apache/nuttx/arch/renesas/src/rx65n/rx65n_riic.c
/****************************************************************************
 * arch/renesas/src/rx65n/rx65n_riic.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <stdio.h>
#include <stdint.h>
#include <errno.h>
#include <nuttx/semaphore.h>
#include <nuttx/kthread.h>
#include "rx65n_riic.h"
#include "rx65n_definitions.h"
#include <arch/board/board.h>
#include <arch/board/rx65n_gpio.h>
#include <nuttx/arch.h>
#include <nuttx/irq.h>
#include "up_arch.h"
/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

# define rx65n_getreg(addr)      getreg8(addr)
# define rx65n_putreg(val,addr)  putreg8(val,addr)

#if defined(CONFIG_RX65N_RIIC0) || defined(CONFIG_RX65N_RIIC1) || \
    defined(CONFIG_RX65N_RIIC2)

/****************************************************************************
 * Typedef definitions
 ****************************************************************************/

/****************************************************************************
 * Private Types
 ****************************************************************************/

enum rx65n_i2c_mode_e
{
  RIIC_NONE = 0,             /* Uninitialized state */
  RIIC_READY,                /* Ready for operation */
  RIIC_M_TRANSMIT,           /* Master transmission mode */
  RIIC_M_RECEIVE,            /* Master reception mode */
  RIIC_FINISH,               /* Successful operation */
};

enum rx65n_i2c_dev_sts_e
{
  RIIC_STS_NO_INIT = 0,        /* None initialization state */
  RIIC_STS_IDLE,               /* Idle state */
  RIIC_STS_ST_COND_WAIT,       /* Start condition generation completion wait state */
  RIIC_STS_SEND_SLVADR_W_WAIT, /* Slave address [Write] transmission completion wait state */
  RIIC_STS_SEND_SLVADR_R_WAIT, /* Slave address [Read] transmission completion wait state */
  RIIC_STS_SEND_DATA_WAIT,     /* Data transmission completion wait state */
  RIIC_STS_RECEIVE_DATA_WAIT,  /* Data reception completion wait state */
  RIIC_STS_SP_COND_WAIT,       /* Stop condition generation completion wait state */
  RIIC_STS_AL,                 /* Detect Arbitration Lost */
  RIIC_STS_TMO,                /* Detect Time out */
  RIIC_STS_MAX,                /* Prohibition of setup above here */
};

enum rx65n_i2c_event_e
{
  RIIC_EV_NONE = 0,
  RIIC_EV_GEN_START_COND,  /* Called function of Start condition generation */
  RIIC_EV_INT_START,       /* Interrupted start codition generation */
  RIIC_EV_INT_ADD,         /* Interrupted address sending */
  RIIC_EV_INT_SEND,        /* Interrupted data sending */
  RIIC_EV_INT_RECEIVE,     /* Interrupted data receiving */
  RIIC_EV_INT_STOP,        /* Interrupted Stop condition generation */
  RIIC_EV_INT_AL,          /* Interrupted Arbitration-Lost */
  RIIC_EV_INT_NACK,        /* Interrupted No Acknowledge */
  RIIC_EV_INT_TXI,         /* Interrupted transmitted buffer empty */
  RIIC_EV_INT_TMO,         /* Interrupted Time out */
  RIIC_EV_MAX,             /* Prohibition of setup above here */
};

struct rx65n_i2c_dev_s
{
  uint32_t  base;       /* Base address of registers */
  uint32_t  frequency;  /* Configured kbps */
  uint8_t   txi_irq;    /* TXI IRQ Number */
  uint8_t   rxi_irq;    /* RXI IRQ Number */
  uint8_t   tei_irq;    /* TEI IRQ Number */
  uint8_t   eei_irq;    /* EEI IRQ Number */
  uint32_t  grpbase;
  uint32_t  teimask;
  uint32_t  eeimask;
};

struct rx65n_i2c_priv_s
{
  const struct      i2c_ops_s *ops;
  const struct      rx65n_i2c_dev_s *dev;
  int refs;                          /* Referernce count */
  int bus;                           /* Bus number */
  volatile uint8_t  mode;            /* See enum rx65n_i2c_mode_e */
  volatile uint8_t  dev_sts;         /* See enum rx65n_i2c_dev_sts_e */
  volatile uint8_t  event;           /* See enum rx65n_i2c_event_e */
  sem_t             sem_excl;        /* Mutual exclusion semaphore */
  sem_t             sem_isr;         /* Interrupt wait semaphore */
  uint8_t           msgc;            /* Number of Messages */
  struct            i2c_msg_s *msgv; /* Message list */
  uint8_t           *ptr;            /* Current message buffer */
  int               dcnt;            /* Bytes remaining to transfer */
  uint16_t          flags;           /* Current message flags */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static int rx65n_riic_iicrst(FAR struct rx65n_i2c_priv_s *priv);
static void rx65n_riic_setclock(FAR struct rx65n_i2c_priv_s *priv,
                                 uint32_t frequency);
static void rx65n_riic_init(FAR struct rx65n_i2c_priv_s *priv);
static int rx65n_riic_startcond(FAR struct rx65n_i2c_priv_s *priv);
static void rx65n_riic_restartcond(FAR struct rx65n_i2c_priv_s *priv);
static void rx65n_riic_send_slv_addr(FAR struct rx65n_i2c_priv_s *priv);
static void rx65n_riic_after_send_slvadr(FAR struct rx65n_i2c_priv_s *priv);
static void rx65n_riic_master_transmit(FAR struct rx65n_i2c_priv_s *priv);
static void rx65n_riic_master_receive(FAR struct rx65n_i2c_priv_s *priv);
static void rx65n_riic_stopcond(FAR struct rx65n_i2c_priv_s *priv);
static void rx65n_riic_advance(FAR struct rx65n_i2c_priv_s *priv);
static uint8_t rx65n_riic_read_data(FAR struct rx65n_i2c_priv_s *priv);
static void rx65n_riic_wait_set(FAR struct rx65n_i2c_priv_s *priv);
static void rx65n_riic_pre_end_set(FAR struct rx65n_i2c_priv_s *priv);
static void rx65n_riic_end_set(FAR struct rx65n_i2c_priv_s *priv);
static void rx65n_riic_nack(FAR struct rx65n_i2c_priv_s *priv);
static void rx65n_riic_set_sending_data(FAR struct rx65n_i2c_priv_s *priv, \
                                          uint8_t data);
static int rx65n_riic_after_stop(FAR struct rx65n_i2c_priv_s *priv);
static bool rx65n_riic_check_bus_busy(FAR struct rx65n_i2c_priv_s *priv);
static void rx65n_riic_set_icier(FAR struct rx65n_i2c_priv_s *priv, \
                                          uint8_t value);
static void rx65n_riic_timeout(FAR struct rx65n_i2c_priv_s *priv);

/* RIIC Interrupt Handling */

static void rx65n_riic_int_disable(FAR struct rx65n_i2c_priv_s *priv);
static void rx65n_riic_int_enable(FAR struct rx65n_i2c_priv_s *priv);
static int rx65n_riic_irq_init(FAR struct rx65n_i2c_priv_s *priv);

