apache/nuttx/arch/renesas/src/rx65n/rx65n_riic.c
/* RIIC0 Channel Interrupt Handling */

static int rx65n_riic_rxi0interrupt(int irq,
  FAR void *context, FAR void *arg);
static int rx65n_riic_txi0interrupt(int irq,
  FAR void *context, FAR void *arg);
static int rx65n_riic_eei0interrupt(int irq,
  FAR void *context, FAR void *arg);
static int rx65n_riic_tei0interrupt(int irq,
  FAR void *context, FAR void *arg);

/* RIIC1 Channel Interrupt Handling */

static int rx65n_riic_rxi1interrupt(int irq,
  FAR void *context, FAR void *arg);
static int rx65n_riic_txi1interrupt(int irq,
  FAR void *context, FAR void *arg);
static int rx65n_riic_eei1interrupt(int irq,
  FAR void *context, FAR void *arg);
static int rx65n_riic_tei1interrupt(int irq,
  FAR void *context, FAR void *arg);

/* RIIC2 Channel Interrupt Handling */

static int rx65n_riic_rxi2interrupt(int irq,
  FAR void *context, FAR void *arg);
static int rx65n_riic_txi2interrupt(int irq,
  FAR void *context, FAR void *arg);
static int rx65n_riic_eei2interrupt(int irq,
  FAR void *context, FAR void *arg);
static int rx65n_riic_tei2interrupt(int irq,
  FAR void *context, FAR void *arg);

/* I2C operations */

static int rx65n_i2c_transfer(FAR struct i2c_master_s *dev, \
                                FAR struct i2c_msg_s *msgs, int count);
#ifdef CONFIG_I2C_RESET
static int rx65n_i2c_reset(FAR struct i2c_master_s *dev);
#endif

/****************************************************************************
 * Public Function Prototypes
 ****************************************************************************/

void up_enable_irq(int irq);
void up_disable_irq(int irq);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* Device Structures, Instantiation */

static const struct i2c_ops_s rx65n_i2c_ops =
{
  .transfer = rx65n_i2c_transfer
#ifdef CONFIG_I2C_RESET
  , .reset  = rx65n_i2c_reset
#endif
};

#ifdef CONFIG_RX65N_RIIC0
static const struct rx65n_i2c_dev_s rx65n_riic0_dev =
{
  .base       = RX65N_RIIC0_BASE,
  .frequency  = CONFIG_RX65N_RIIC0_BITRATE,
  .txi_irq    = RX65N_RIIC0_TXI0_IRQ,
  .rxi_irq    = RX65N_RIIC0_RXI0_IRQ,
  .tei_irq    = RX65N_RIIC0_TEI0_IRQ,
  .eei_irq    = RX65N_RIIC0_EEI0_IRQ,
  .grpbase    = RX65N_GRPBL1_ADDR,
  .teimask    = RX65N_GRPBL1_TEI0_MASK,
  .eeimask    = RX65N_GRPBL1_EEI0_MASK,
};

static struct rx65n_i2c_priv_s rx65n_riic0_priv =
{
  .ops       = &rx65n_i2c_ops,
  .dev       = &rx65n_riic0_dev,
  .refs      = 0,
  .bus       = 0,
  .mode      = RIIC_NONE,
  .dev_sts   = RIIC_STS_NO_INIT,
  .event     = RIIC_EV_NONE,
  .msgc      = 0,
  .msgv      = NULL,
  .ptr       = NULL,
  .dcnt      = 0,
  .flags     = 0,
};
#endif

#ifdef CONFIG_RX65N_RIIC1
static const struct rx65n_i2c_dev_s rx65n_riic1_dev =
{
  .base      = RX65N_RIIC1_BASE,
  .frequency = CONFIG_RX65N_RIIC1_BITRATE,
  .txi_irq   = RX65N_RIIC1_TXI1_IRQ,
  .rxi_irq   = RX65N_RIIC1_RXI1_IRQ,
  .tei_irq   = RX65N_RIIC1_TEI1_IRQ,
  .eei_irq   = RX65N_RIIC1_EEI1_IRQ,
  .grpbase   = RX65N_GRPBL1_ADDR,
  .teimask   = RX65N_GRPBL1_TEI1_MASK,
  .eeimask   = RX65N_GRPBL1_EEI1_MASK,
};

static struct rx65n_i2c_priv_s rx65n_riic1_priv =
{
  .ops       = &rx65n_i2c_ops,
  .dev       = &rx65n_riic1_dev,
  .refs      = 0,
  .bus       = 1,
  .mode      = RIIC_NONE,
  .dev_sts   = RIIC_STS_NO_INIT,
  .event     = RIIC_EV_NONE,
  .msgc      = 0,
  .msgv      = NULL,
  .ptr       = NULL,
  .dcnt      = 0,
  .flags     = 0,
};
#endif

#ifdef CONFIG_RX65N_RIIC2
static const struct rx65n_i2c_dev_s rx65n_riic2_dev =
{
  .base      = RX65N_RIIC2_BASE,
  .frequency = CONFIG_RX65N_RIIC2_BITRATE,
  .txi_irq   = RX65N_RIIC2_TXI2_IRQ,
  .rxi_irq   = RX65N_RIIC2_RXI2_IRQ,
  .tei_irq   = RX65N_RIIC2_TEI2_IRQ,
  .eei_irq   = RX65N_RIIC2_EEI2_IRQ,
  .grpbase   = RX65N_GRPBL1_ADDR,
  .teimask   = RX65N_GRPBL1_TEI2_MASK,
  .eeimask   = RX65N_GRPBL1_EEI2_MASK,
};

static struct rx65n_i2c_priv_s rx65n_riic2_priv =
{
  .ops       = &rx65n_i2c_ops,
  .dev       = &rx65n_riic2_dev,
  .refs      = 0,
  .bus       = 2,
  .mode      = RIIC_NONE,
  .dev_sts   = RIIC_STS_NO_INIT,
  .event     = RIIC_EV_NONE,
  .msgc      = 0,
  .msgv      = NULL,
  .ptr       = NULL,
  .dcnt      = 0,
  .flags     = 0,
};
#endif

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: riic_mpc_enable
 *
 * Description:
 * Enable writing to registers
 ****************************************************************************/

static void riic_mpc_enable(void)
{
  /* Enable writing to registers related to operating modes,
   * LPC, CGC and software reset
   */

  SYSTEM.PRCR.WORD = 0xa50b;

  /* Enable writing to MPC pin function control registers */

  MPC.PWPR.BIT.B0WI = 0;
  MPC.PWPR.BIT.PFSWE = 1;
}

/****************************************************************************
 * Name: riic_mpc_disable
 *
 * Description:
 * Disable writing to registers
 ****************************************************************************/

static void riic_mpc_disable(void)
{
  /* Disable writing to MPC pin function control registers */

  MPC.PWPR.BIT.PFSWE = 0;
  MPC.PWPR.BIT.B0WI = 1;

  /* Enable protection */

  SYSTEM.PRCR.WORD = 0xa500;
}

/****************************************************************************
 * Name: rx65n_riic_iicrst
 *
 * Description:
 *   Disable writing to registers
 ****************************************************************************/

static int rx65n_riic_iicrst(FAR struct rx65n_i2c_priv_s *priv)
{
  uint8_t regval;

  if (priv->bus == 0)
    {
      regval = rx65n_getreg(RX65N_RIIC0_ICCR1);
      regval |= RX65N_RIIC_ICCR1_IICRST_SET;
      rx65n_putreg(regval, RX65N_RIIC0_ICCR1);
      regval = rx65n_getreg(RX65N_RIIC0_ICCR1);

      regval = rx65n_getreg(RX65N_RIIC0_ICCR1);
      regval &= ~(RX65N_RIIC_ICCR1_IICRST_SET);
      rx65n_putreg(regval, RX65N_RIIC0_ICCR1);
      regval = rx65n_getreg(RX65N_RIIC0_ICCR1);
    }

  else if (priv->bus == 1)
    {
      regval = rx65n_getreg(RX65N_RIIC1_ICCR1);
      regval |= RX65N_RIIC_ICCR1_IICRST_SET;
      rx65n_putreg(regval, RX65N_RIIC1_ICCR1);
      regval = rx65n_getreg(RX65N_RIIC1_ICCR1);

