apache/nuttx/arch/renesas/src/rx65n/rx65n_riic.c
      regval = rx65n_getreg(RX65N_RIIC1_ICCR1);
      regval &= ~(RX65N_RIIC_ICCR1_IICRST_SET);
      rx65n_putreg(regval, RX65N_RIIC1_ICCR1);
      regval = rx65n_getreg(RX65N_RIIC1_ICCR1);
    }

  else
    {
      regval = rx65n_getreg(RX65N_RIIC2_ICCR1);
      regval |= RX65N_RIIC_ICCR1_IICRST_SET;
      rx65n_putreg(regval, RX65N_RIIC2_ICCR1);
      regval = rx65n_getreg(RX65N_RIIC2_ICCR1);

      regval = rx65n_getreg(RX65N_RIIC2_ICCR1);
      regval &= ~(RX65N_RIIC_ICCR1_IICRST_SET);
      rx65n_putreg(regval, RX65N_RIIC2_ICCR1);
      regval = rx65n_getreg(RX65N_RIIC2_ICCR1);
    }

  return OK;
}

/****************************************************************************
 * Name: rx65n_riic_set_icier
 *
 * Description:
 *   Sets interrupt enable register ICIER for RIIC communication
 *
 ****************************************************************************/

static void rx65n_riic_set_icier(FAR struct rx65n_i2c_priv_s *priv, \
                                             uint8_t value)
{
  uint8_t regval;
  regval = (value | RX65N_RIIC_ICIER_TMO);

  if (0 == priv->bus)
    {
      rx65n_putreg(regval, RX65N_RIIC0_ICIER);
      regval = rx65n_getreg(RX65N_RIIC0_ICIER);
    }

  else if (1 == priv->bus)
    {
      rx65n_putreg(regval, RX65N_RIIC1_ICIER);
      regval = rx65n_getreg(RX65N_RIIC1_ICIER);
    }

  else
    {
      rx65n_putreg(regval, RX65N_RIIC2_ICIER);
      regval = rx65n_getreg(RX65N_RIIC2_ICIER);
    }
}

/****************************************************************************
 * Name: rx65n_riic_setclock
 *
 * Description:
 *   Sets the I2C bus clock frequency – frequency for the transfer
 *
 ****************************************************************************/

static void rx65n_riic_setclock(FAR struct rx65n_i2c_priv_s *priv,
                                 uint32_t frequency)
{
  /* Divider array of RIIC clock  */

  uint8_t regval;
  const uint8_t d_cks[RIIC_MAX_DIV] =
    { 1, 2, 4, 8, 16, 32, 64, 128
    };

  volatile double l_time;     /* L Width period */
  volatile double h_time;     /* H Width period */
  volatile double calc_val;   /* Using for Calculation */
  double calc_val_tmp;
  volatile uint8_t cnt;

  /* Calculation of L width time */

  l_time = (1.0 / (2.0 * frequency)); /* Half period of frequency */
  h_time = l_time;

  /* Check I2C mode of Speed */

  if (frequency > I2C_SPEED_FAST)
    {
      i2cinfo("Fast Plus Mode Selected - Transmission Rate: 1 Mbps\n");
      if (l_time < 0.5E-6)
        {
          /* Wnen L width less than 0.5us, subtract Rise up and down
           * time for SCL from H/L width
           */

          l_time = 0.5E-6;
          h_time = (((1.0 / frequency) - l_time) - SCL_RISE_TIME_FASTPLUS) \
                 - SCL_FALL_TIME_FASTPLUS;
        }

      else
        {
          /* Subtract Rise up and down time for SCL from H/L width */

          l_time -= SCL_FALL_TIME_FASTPLUS;
          h_time -= SCL_RISE_TIME_FASTPLUS;
        }
    }

  else if (frequency > I2C_SPEED_STANDARD)
    {
      i2cinfo("Fast Mode Selected - Transmission Rate: 400 kbps\n");
      if (l_time < 1.3E-6)
        {
          /* Wnen L width less than 1.3us, subtract Rise up and down
           * time for SCL from H/L width
           */

          l_time = 1.3E-6;
          h_time = (((1.0 / frequency) - l_time) - SCL_RISE_TIME_FAST) \
                    - SCL_FALL_TIME_FAST;
        }

      else
        {
          /* Subtract Rise up and down time for SCL from H/L width */

          l_time -= SCL_FALL_TIME_FAST;
          h_time -= SCL_RISE_TIME_FAST;
        }
    }

  else
    {
      i2cinfo("Standard Mode Selected - Transmission Rate: 100 kbps\n");

      /* Subtract Rise up and down time for SCL from H/L width */

      l_time -= SCL_FALL_TIME_STANDARD;
      h_time -= SCL_RISE_TIME_STANDARD;
    }

  /* Calculate ICBRL value */

  for (calc_val = RIIC_RATE_CALC, cnt = 0; RIIC_CALC_MAX < calc_val; cnt++)
    {
      calc_val = l_time; /* Set L width time */

      /* Check the range of divider of CKS */

      if (cnt >= RIIC_MAX_DIV)
        {
          /* Cannot set bps */
        }

      calc_val_tmp = calc_val;

      /* Calculation of ICBRL value */

      calc_val = (calc_val_tmp / (d_cks[cnt] / RX_PCLKB));
      calc_val = calc_val + 0.5; /* round off */
    }

  if (priv->bus == 0)
    {
      /* Set ICMR1.CKS bits. */

      regval = rx65n_getreg(RX65N_RIIC0_ICMR1);
      regval &= RX65N_RIIC_ICMR1_CKS_MASK;
      regval |= (uint8_t) ((cnt - 1) << 4);
      rx65n_putreg(regval, RX65N_RIIC0_ICMR1);

      /* Set value to ICBRL register */

      regval = (uint8_t) ((uint8_t)(calc_val - 1) | RX65N_RIIC_ICBRL_MASK);
      rx65n_putreg(regval, RX65N_RIIC0_ICBRL);
    }

  else if (priv->bus == 1)
    {
      /* Set ICMR1.CKS bits. */

      regval = rx65n_getreg(RX65N_RIIC1_ICMR1);
      regval &= RX65N_RIIC_ICMR1_CKS_MASK;
      regval |= (uint8_t) ((cnt - 1) << 4);
      rx65n_putreg(regval, RX65N_RIIC1_ICMR1);

      /* Set value to ICBRL register */

      regval = (uint8_t) ((uint8_t)(calc_val - 1) | RX65N_RIIC_ICBRL_MASK);
      rx65n_putreg(regval, RX65N_RIIC1_ICBRL);
    }

  else
    {
      /* Set ICMR1.CKS bits. */

      regval = rx65n_getreg(RX65N_RIIC2_ICMR1);
      regval &= RX65N_RIIC_ICMR1_CKS_MASK;
      regval |= (uint8_t) ((cnt - 1) << 4);
      rx65n_putreg(regval, RX65N_RIIC2_ICMR1);

      /* Set value to ICBRL register */

      regval = (uint8_t) ((uint8_t)(calc_val - 1) | RX65N_RIIC_ICBRL_MASK);
      rx65n_putreg(regval, RX65N_RIIC2_ICBRL);
    }

  /* Calculate ICBRH value */

  calc_val = h_time;
  calc_val_tmp = calc_val;

  /* Calculation ICBRH value */

  calc_val = (calc_val_tmp / (d_cks[cnt - 1] / RX_PCLKB));
  calc_val = (uint8_t) (calc_val + 0.5); /* Round off */

  /* If the calculated value is less than 1, it rounded up to 1. */

  if (1 > calc_val)
    {
      calc_val = 1;
    }

  if (priv->bus == 0)
    {
      /* Set value to ICBRH register */

      regval = (uint8_t) ((uint8_t) (calc_val - 1) | RX65N_RIIC_ICBRH_MASK);
      rx65n_putreg(regval, RX65N_RIIC0_ICBRH);
    }

  else if (priv->bus == 1)
    {
      /* Set value to ICBRH register */

      regval = (uint8_t) ((uint8_t) (calc_val - 1) | RX65N_RIIC_ICBRH_MASK);
      rx65n_putreg(regval, RX65N_RIIC1_ICBRH);
    }

  else
    {
      /* Set value to ICBRH register */

      regval = (uint8_t) ((uint8_t) (calc_val - 1) | RX65N_RIIC_ICBRH_MASK);
      rx65n_putreg(regval, RX65N_RIIC2_ICBRH);
    }
}

/****************************************************************************
 * Name: rx65n_riic_int_enable
 *
 * Description:
 *   Enable Interrupts
 *
 ****************************************************************************/

static void rx65n_riic_int_enable(FAR struct rx65n_i2c_priv_s *priv)
{
  up_enable_irq(priv->dev->txi_irq);
  up_enable_irq(priv->dev->rxi_irq);
  up_enable_irq(priv->dev->tei_irq);
  up_enable_irq(priv->dev->eei_irq);
}

/****************************************************************************
 * Name: rx65n_riic_int_disable
 *
 * Description:
 *   Disable Interrupts
 *
 ****************************************************************************/

static void rx65n_riic_int_disable(FAR struct rx65n_i2c_priv_s *priv)
{
  up_disable_irq(priv->dev->txi_irq);
  up_disable_irq(priv->dev->rxi_irq);
  up_disable_irq(priv->dev->tei_irq);
  up_disable_irq(priv->dev->eei_irq);
}

/****************************************************************************
 * Name: rx65n_riic_irq_init
 *
 * Description:
 *   Setup the initial conditions of I2C interrupt handling
 *
 ****************************************************************************/

static int rx65n_riic_irq_init(FAR struct rx65n_i2c_priv_s *priv)
{
  int ret;

  IEN(ICU, GROUPBL1) = 0;     /* Disable Group BL1 interrupts */
  IR(ICU, GROUPBL1)  = 0;     /* Clear interrupt flag */
  IPR(ICU, GROUPBL1) = RIIC_INTERRUPT_PRIO;
  IEN(ICU, GROUPBL1) = 1;     /* Enable Group BL1 interrupt */

