apache/nuttx/arch/renesas/src/rx65n/rx65n_riic.c
  if (priv->bus == 0)
    {
      IR(RIIC0, RXI0)  = 0;
      IPR(RIIC0, RXI0) = RIIC_INTERRUPT_PRIO;

      IR(RIIC0, TXI0)  = 0;
      IPR(RIIC0, TXI0) = RIIC_INTERRUPT_PRIO;

      ret = irq_attach(priv->dev->rxi_irq, rx65n_riic_rxi0interrupt, priv);
      ret = irq_attach(priv->dev->txi_irq, rx65n_riic_txi0interrupt, priv);
      ret = irq_attach(priv->dev->tei_irq, rx65n_riic_tei0interrupt, priv);
      ret = irq_attach(priv->dev->eei_irq, rx65n_riic_eei0interrupt, priv);
    }

  else if (priv->bus == 1)
    {
      IR(RIIC1, RXI1)  = 0;
      IPR(RIIC1, RXI1) = RIIC_INTERRUPT_PRIO;

      IR(RIIC1, TXI1)  = 0;
      IPR(RIIC1, TXI1) = RIIC_INTERRUPT_PRIO;

      ret = irq_attach(priv->dev->rxi_irq, rx65n_riic_rxi1interrupt, priv);
      ret = irq_attach(priv->dev->txi_irq, rx65n_riic_txi1interrupt, priv);
      ret = irq_attach(priv->dev->tei_irq, rx65n_riic_tei1interrupt, priv);
      ret = irq_attach(priv->dev->eei_irq, rx65n_riic_eei1interrupt, priv);
    }

  else
    {
      IR(RIIC2, RXI2)  = 0;
      IPR(RIIC2, RXI2) = RIIC_INTERRUPT_PRIO;

      IR(RIIC2, TXI2)  = 0;
      IPR(RIIC2, TXI2) = RIIC_INTERRUPT_PRIO;

      ret = irq_attach(priv->dev->rxi_irq, rx65n_riic_rxi2interrupt, priv);
      ret = irq_attach(priv->dev->txi_irq, rx65n_riic_txi2interrupt, priv);
      ret = irq_attach(priv->dev->tei_irq, rx65n_riic_tei2interrupt, priv);
      ret = irq_attach(priv->dev->eei_irq, rx65n_riic_eei2interrupt, priv);
    }

  rx65n_riic_int_enable(priv);

  return ret;
}

/****************************************************************************
 * Name: rx65n_riic_init
 *
 * Description:
 *   Setup the initial conditions of I2C hardware and be ready for operation
 *
 ****************************************************************************/

static void rx65n_riic_init(FAR struct rx65n_i2c_priv_s *priv)
{
  uint8_t regval;

  /* Disable RXI, TXI,TEI and EEI interrupts */

  rx65n_riic_int_disable(priv);

  /* RIIC registers initialization */

  if (priv->bus == 0)
    {
      /* Release from the module-stop state */

      MSTP_RIIC0 = 0;

      /* SCLn and SDAn pins not driven - RIIC disabled */

      regval = rx65n_getreg(RX65N_RIIC0_ICCR1);
      regval &= RX65N_RIIC_ICCR1_ICE_RST;
      rx65n_putreg(regval, RX65N_RIIC0_ICCR1);

      /* RIIC Reset */

      regval = rx65n_getreg(RX65N_RIIC0_ICCR1);
      regval |= RX65N_RIIC_ICCR1_IICRST_SET;
      rx65n_putreg(regval, RX65N_RIIC0_ICCR1);

      /* Internal reset, SCLn and SDAn pins in active state */

      regval = rx65n_getreg(RX65N_RIIC0_ICCR1);
      regval |= ~(RX65N_RIIC_ICCR1_ICE_RST);
      rx65n_putreg(regval, RX65N_RIIC0_ICCR1);

      /* Set SARLy and SARUy */

      rx65n_putreg(RIIC_REG_INIT, RX65N_RIIC0_SARL0);
      rx65n_putreg(RIIC_REG_INIT, RX65N_RIIC0_SARU0);
      rx65n_putreg(RIIC_REG_INIT, RX65N_RIIC0_SARL1);
      rx65n_putreg(RIIC_REG_INIT, RX65N_RIIC0_SARU1);
      rx65n_putreg(RIIC_REG_INIT, RX65N_RIIC0_SARL2);
      rx65n_putreg(RIIC_REG_INIT, RX65N_RIIC0_SARU2);

      /* Set I2C bus frequency */

      rx65n_riic_setclock(priv, priv->dev->frequency);

      regval = rx65n_getreg(RX65N_RIIC0_ICSER);
      regval &= RX65N_RIIC_ICSER_SET;
      rx65n_putreg(regval, RX65N_RIIC0_ICSER);

#ifndef CONFIG_RX65N_RIIC0_NF
      RIIC0.ICFER.BIT.NFE = 0;
#else
      regval = rx65n_getreg(RX65N_RIIC0_ICMR3);
      switch (CONFIG_RX65N_RIIC0_NF_STAGE)
        {
          case 1:
                  regval |= RX65N_RIIC_ICMR3_NF1;
               break;

          case 2:
                  regval |= RX65N_RIIC_ICMR3_NF2;
               break;

          case 3:
                  regval |= RX65N_RIIC_ICMR3_NF3;
               break;

          case 4:
               regval |= RX65N_RIIC_ICMR3_NF4;
            break;
        }

      rx65n_putreg(regval, RX65N_RIIC0_ICMR3);
#endif

      rx65n_putreg(RIIC_REG_INIT, RX65N_RIIC0_ICIER);

      regval = rx65n_getreg(RX65N_RIIC0_ICFER);
      regval |= RX65N_RIIC_ICFER_TMOE_SET;
      rx65n_putreg(regval, RX65N_RIIC0_ICFER);

#ifdef CONFIG_RX65N_RIIC0_SDA_DELAY
      RIIC0.ICMR2.BIT.DLCS = 1;
      regval = rx65n_getreg(RX65N_RIIC0_ICMR2);
      switch (CONFIG_RX65N_RIIC0_DELAY_CNT)
        {
          case 0:
            regval |= RX65N_RIIC_ICMR2_SDDL0;
            break;

          case 1:
            regval |= RX65N_RIIC_ICMR2_SDDL1;
            break;

          case 2:
            regval |= RX65N_RIIC_ICMR2_SDDL2;
            break;

          case 3:
            regval |= RX65N_RIIC_ICMR2_SDDL3;
            break;

          case 4:
            regval |= RX65N_RIIC_ICMR2_SDDL4;
            break;

          case 5:
            regval |= RX65N_RIIC_ICMR2_SDDL5;
            break;

          case 6:
            regval |= RX65N_RIIC_ICMR2_SDDL6;
            break;

          case 7:
            regval |= RX65N_RIIC_ICMR2_SDDL7;
            break;
        }

      rx65n_putreg(regval, RX65N_RIIC0_ICMR2);
#endif 

      rx65n_riic_irq_init(priv);

      regval = rx65n_getreg(RX65N_RIIC0_ICCR1);
      regval &= ~(RX65N_RIIC_ICCR1_IICRST_SET);
      rx65n_putreg(regval, RX65N_RIIC0_ICCR1);
    }

  else if (priv->bus == 1)
    {
      /* Release from the module-stop state */

      MSTP_RIIC1 = 0;

      /* SCLn and SDAn pins not driven - RIIC disabled */

      regval = rx65n_getreg(RX65N_RIIC1_ICCR1);
      regval &= RX65N_RIIC_ICCR1_ICE_RST;
      rx65n_putreg(regval, RX65N_RIIC1_ICCR1);

      /* RIIC Reset */

      regval = rx65n_getreg(RX65N_RIIC1_ICCR1);
      regval |= RX65N_RIIC_ICCR1_IICRST_SET;
      rx65n_putreg(regval, RX65N_RIIC1_ICCR1);

      /* Internal reset, SCLn and SDAn pins in active state */

      regval = rx65n_getreg(RX65N_RIIC1_ICCR1);
      regval |= ~(RX65N_RIIC_ICCR1_ICE_RST);
      rx65n_putreg(regval, RX65N_RIIC1_ICCR1);

      /* Set SARLy and SARUy */

      rx65n_putreg(RIIC_REG_INIT, RX65N_RIIC1_SARL0);
      rx65n_putreg(RIIC_REG_INIT, RX65N_RIIC1_SARU0);
      rx65n_putreg(RIIC_REG_INIT, RX65N_RIIC1_SARL1);
      rx65n_putreg(RIIC_REG_INIT, RX65N_RIIC1_SARU1);
      rx65n_putreg(RIIC_REG_INIT, RX65N_RIIC1_SARL2);
      rx65n_putreg(RIIC_REG_INIT, RX65N_RIIC1_SARU2);

      /* Set I2C bus frequency */

      rx65n_riic_setclock(priv, priv->dev->frequency);

      regval = rx65n_getreg(RX65N_RIIC1_ICSER);
      regval &= RX65N_RIIC_ICSER_SET;
      rx65n_putreg(regval, RX65N_RIIC1_ICSER);

#ifndef CONFIG_RX65N_RIIC1_NF
      RIIC1.ICFER.BIT.NFE = 0;
#else
      regval = rx65n_getreg(RX65N_RIIC1_ICMR3);
      switch (CONFIG_RX65N_RIIC1_NF_STAGE)
        {
          case 1:
                  regval |= RX65N_RIIC_ICMR3_NF1;
               break;

