apache/nuttx/arch/renesas/src/rx65n/rx65n_riic.c
          case 2:
                  regval |= RX65N_RIIC_ICMR3_NF2;
               break;

          case 3:
                  regval |= RX65N_RIIC_ICMR3_NF3;
               break;

          case 4:
               regval |= RX65N_RIIC_ICMR3_NF4;
            break;
        }

      rx65n_putreg(regval, RX65N_RIIC1_ICMR3);
#endif

      rx65n_putreg(RIIC_REG_INIT, RX65N_RIIC1_ICIER);

      regval = rx65n_getreg(RX65N_RIIC1_ICFER);
      regval |= RX65N_RIIC_ICFER_TMOE_SET;
      rx65n_putreg(regval, RX65N_RIIC1_ICFER);

#ifdef CONFIG_RX65N_RIIC1_SDA_DELAY
      RIIC1.ICMR2.BIT.DLCS = 1;
      regval = rx65n_getreg(RX65N_RIIC1_ICMR2);
      switch (CONFIG_RX65N_RIIC1_DELAY_CNT)
        {
          case 0:
            regval |= RX65N_RIIC_ICMR2_SDDL0;
            break;

          case 1:
            regval |= RX65N_RIIC_ICMR2_SDDL1;
            break;

          case 2:
            regval |= RX65N_RIIC_ICMR2_SDDL2;
            break;

          case 3:
            regval |= RX65N_RIIC_ICMR2_SDDL3;
            break;

          case 4:
            regval |= RX65N_RIIC_ICMR2_SDDL4;
            break;

          case 5:
            regval |= RX65N_RIIC_ICMR2_SDDL5;
            break;

          case 6:
            regval |= RX65N_RIIC_ICMR2_SDDL6;
            break;

          case 7:
            regval |= RX65N_RIIC_ICMR2_SDDL7;
            break;
        }

      rx65n_putreg(regval, RX65N_RIIC1_ICMR2);
#endif

      rx65n_riic_irq_init(priv);

      regval = rx65n_getreg(RX65N_RIIC1_ICCR1);
      regval &= ~(RX65N_RIIC_ICCR1_IICRST_SET);
      rx65n_putreg(regval, RX65N_RIIC1_ICCR1);
    }

  else
    {
      /* Release from the module-stop state */

      MSTP_RIIC2 = 0;

      /* SCLn and SDAn pins not driven - RIIC disabled */

      regval = rx65n_getreg(RX65N_RIIC2_ICCR1);
      regval &= RX65N_RIIC_ICCR1_ICE_RST;
      rx65n_putreg(regval, RX65N_RIIC2_ICCR1);

      /* RIIC Reset */

      regval = rx65n_getreg(RX65N_RIIC2_ICCR1);
      regval |= RX65N_RIIC_ICCR1_IICRST_SET;
      rx65n_putreg(regval, RX65N_RIIC2_ICCR1);

      /* Internal reset, SCLn and SDAn pins in active state */

      regval = rx65n_getreg(RX65N_RIIC2_ICCR1);
      regval |= ~(RX65N_RIIC_ICCR1_ICE_RST);
      rx65n_putreg(regval, RX65N_RIIC2_ICCR1);

      /* Set SARLy and SARUy */

      rx65n_putreg(RIIC_REG_INIT, RX65N_RIIC2_SARL0);
      rx65n_putreg(RIIC_REG_INIT, RX65N_RIIC2_SARU0);
      rx65n_putreg(RIIC_REG_INIT, RX65N_RIIC2_SARL1);
      rx65n_putreg(RIIC_REG_INIT, RX65N_RIIC2_SARU1);
      rx65n_putreg(RIIC_REG_INIT, RX65N_RIIC2_SARL2);
      rx65n_putreg(RIIC_REG_INIT, RX65N_RIIC2_SARU2);

      /* Set I2C bus frequency */

      rx65n_riic_setclock(priv, priv->dev->frequency);

      regval = rx65n_getreg(RX65N_RIIC2_ICSER);
      regval &= RX65N_RIIC_ICSER_SET;
      rx65n_putreg(regval, RX65N_RIIC2_ICSER);

#ifndef CONFIG_RX65N_RIIC2_NF
      RIIC2.ICFER.BIT.NFE = 0;
#else
      regval = rx65n_getreg(RX65N_RIIC2_ICMR3);
      switch (CONFIG_RX65N_RIIC2_NF_STAGE)
        {
          case 1:
                  regval |= RX65N_RIIC_ICMR3_NF1;
               break;

          case 2:
                  regval |= RX65N_RIIC_ICMR3_NF2;
               break;

          case 3:
                  regval |= RX65N_RIIC_ICMR3_NF3;
               break;

          case 4:
                  regval |= RX65N_RIIC_ICMR3_NF4;
               break;
           }

      rx65n_putreg(regval, RX65N_RIIC2_ICMR3);
#endif

      rx65n_putreg(RIIC_REG_INIT, RX65N_RIIC2_ICIER);

      regval = rx65n_getreg(RX65N_RIIC2_ICFER);
      regval |= RX65N_RIIC_ICFER_TMOE_SET;
      rx65n_putreg(regval, RX65N_RIIC2_ICFER);

#ifdef CONFIG_RX65N_RIIC2_SDA_DELAY
      RIIC2.ICMR2.BIT.DLCS = 1;
      regval = rx65n_getreg(RX65N_RIIC2_ICMR2);
      switch (CONFIG_RX65N_RIIC2_DELAY_CNT)
        {
          case 0:
            regval |= RX65N_RIIC_ICMR2_SDDL0;
            break;

          case 1:
            regval |= RX65N_RIIC_ICMR2_SDDL1;
            break;

          case 2:
            regval |= RX65N_RIIC_ICMR2_SDDL2;
            break;

          case 3:
            regval |= RX65N_RIIC_ICMR2_SDDL3;
            break;

          case 4:
            regval |= RX65N_RIIC_ICMR2_SDDL4;
            break;

          case 5:
            regval |= RX65N_RIIC_ICMR2_SDDL5;
            break;

          case 6:
            regval |= RX65N_RIIC_ICMR2_SDDL6;
            break;

          case 7:
            regval |= RX65N_RIIC_ICMR2_SDDL7;
            break;
        }

      rx65n_putreg(regval, RX65N_RIIC2_ICMR2);
#endif

      rx65n_riic_irq_init(priv);

      regval = rx65n_getreg(RX65N_RIIC2_ICCR1);
      regval &= ~(RX65N_RIIC_ICCR1_IICRST_SET);
      rx65n_putreg(regval, RX65N_RIIC2_ICCR1);
    }

  priv->mode = RIIC_READY;
  priv->dev_sts = RIIC_STS_IDLE;

  /* RIIC registers initialized */
}

/****************************************************************************
 * Function Name: rx65n_riic_set_sending_data
 * Description  : Transmit Data Processing.
 *                Sets transmission data to ICDRT register.
 * Arguments    : rx65n_i2c_priv_s *priv      ; IIC Information
 * Return Value : None
 ****************************************************************************/

static void rx65n_riic_set_sending_data (FAR struct rx65n_i2c_priv_s *priv, \
                                                  uint8_t data)
{
  if (0 == priv->bus)
    {
      /* Clears TXI interrupt request register. */

      IR(RIIC0, TXI0) = 0;

      /* Sets the transmitting data. */

      rx65n_putreg(data, RX65N_RIIC0_ICDRT);
      data = rx65n_getreg(RX65N_RIIC0_ICDRT);
    }

  else if (1 == priv->bus)
    {
      /* Clears TXI interrupt request register. */

      IR(RIIC1, TXI1) = 0;

      /* Sets the transmitting data. */

      rx65n_putreg(data, RX65N_RIIC1_ICDRT);
      data = rx65n_getreg(RX65N_RIIC1_ICDRT);
    }

  else
    {
      /* Clears TXI interrupt request register. */

      IR(RIIC2, TXI2) = 0;

      /* Sets the transmitting data. */

      rx65n_putreg(data, RX65N_RIIC2_ICDRT);
      data = rx65n_getreg(RX65N_RIIC2_ICDRT);
    }
}

/****************************************************************************
 * Name: rx65n_riic_advance
 *
 * Description:
 *  Check if RIIC Bus is busy
 *
 ****************************************************************************/

static void rx65n_riic_advance(FAR struct rx65n_i2c_priv_s *priv)
{
  int ret;

  if ((RIIC_EV_INT_TMO == priv->event)  || (RIIC_STS_TMO == priv->dev_sts))
    {
      i2cerr("RIIC Transfer Timed Out\n");
      rx65n_riic_timeout(priv);
    }

  if (RIIC_EV_INT_AL == priv->event)
    {
      rx65n_riic_iicrst(priv);
    }

  if (RIIC_EV_INT_START == priv->event)
    {
      rx65n_riic_send_slv_addr(priv);
    }

  if (RIIC_EV_INT_ADD == priv->event)
    {
      rx65n_riic_after_send_slvadr(priv);
    }

  if (RIIC_EV_INT_SEND == priv->event)
    {
      rx65n_riic_master_transmit(priv);
    }

