apache/nuttx/arch/renesas/src/rx65n/rx65n_riic.c
  if (RIIC_EV_INT_RECEIVE == priv->event)
    {
      if (RIIC_STS_RECEIVE_DATA_WAIT == priv->dev_sts)
        {
          rx65n_riic_master_receive(priv);
        }

      else
        {
          rx65n_riic_after_send_slvadr(priv);
        }
    }

  if (RIIC_EV_INT_NACK == priv->event)
    {
      rx65n_riic_nack(priv);
    }

  if (RIIC_EV_INT_STOP == priv->event)
    {
      ret = rx65n_riic_after_stop(priv);
      if (RIIC_SUCCESS == ret)
        {
          priv->mode = RIIC_FINISH;
        }
    }
}

/****************************************************************************
 * Name: rx65n_riic_nack
 *
 * Description:
 *  NACK reception handler
 *
 ****************************************************************************/

static void rx65n_riic_nack(FAR struct rx65n_i2c_priv_s *priv)
{
  rx65n_riic_set_icier(priv, RX65N_RIIC_ICIER_SP_AL);

  priv->dev_sts = RIIC_STS_SP_COND_WAIT;
  rx65n_riic_stopcond(priv);

  if (RIIC_M_RECEIVE == priv->mode)
    {
      rx65n_riic_read_data(priv);
    }
}

/****************************************************************************
 * Name: rx65n_riic_timeout
 *
 * Description:
 *  After Timeout condition processing
 *
 ****************************************************************************/

static void rx65n_riic_timeout(FAR struct rx65n_i2c_priv_s *priv)
{
  priv->mode = RIIC_FINISH;
}

/****************************************************************************
 * Name: rx65n_riic_after_stop
 *
 * Description:
 *  After stop condition processing
 *
 ****************************************************************************/

static int rx65n_riic_after_stop(FAR struct rx65n_i2c_priv_s *priv)
{
  int ret;
  bool bus;

  bus = rx65n_riic_check_bus_busy(priv);

  if (bus == RIIC_BUS_BUSY)
    {
      ret = RIIC_ERR_BUS_BUSY;
    }

  else
    {
      if (RIIC_EV_INT_TMO == priv->event)
        {
          ret = RIIC_ERR_TMO;
        }

      else
        {
          ret = RIIC_SUCCESS;
        }
    }

  return ret;
}

/****************************************************************************
 * Name: rx65n_riic_check_bus_busy
 *
 * Description:
 *  Check if RIIC Bus is busy
 *
 ****************************************************************************/

static bool rx65n_riic_check_bus_busy(FAR struct rx65n_i2c_priv_s *priv)
{
  int i;
  bool bus_state = RIIC_BUS_BUSY;

  if (priv->bus == 0)
    {
      for (i = BUS_CHECK_COUNTER; i >= 0; i--)
        {
          if ((0U == RIIC0.ICCR2.BIT.BBSY) && (1U == RIIC0.ICCR1.BIT.SCLI) &&
             (1U == RIIC0.ICCR1.BIT.SDAI))
            {
              bus_state = RIIC_BUS_FREE;
              break;
            }
        }
    }

  if (priv->bus == 1)
    {
      for (i = BUS_CHECK_COUNTER; i >= 0; i--)
        {
          if ((0U == RIIC1.ICCR2.BIT.BBSY) && (1U == RIIC1.ICCR1.BIT.SCLI) &&
             (1U == RIIC1.ICCR1.BIT.SDAI))
            {
              bus_state = RIIC_BUS_FREE;
              break;
            }
        }
    }

  else
    {
      for (i = BUS_CHECK_COUNTER; i >= 0; i--)
        {
          if ((0U == RIIC2.ICCR2.BIT.BBSY) && (1U == RIIC2.ICCR1.BIT.SCLI) &&
             (1U == RIIC2.ICCR1.BIT.SDAI))
            {
              bus_state = RIIC_BUS_FREE;
              break;
            }
        }
    }

  return bus_state;
}

/****************************************************************************
 * Name: rx65n_riic_startcond
 *
 * Description:
 *  Issue the start condition for Master transmission/reception
 *
 ****************************************************************************/

static int rx65n_riic_startcond(FAR struct rx65n_i2c_priv_s *priv)
{
  uint8_t regval;
  int ret = RIIC_SUCCESS;
  bool bus;

  if (priv->bus == 0)
    {
      bus = rx65n_riic_check_bus_busy(priv);

      if (bus == RIIC_BUS_FREE)
        {
          /* Clear stop */

          regval = rx65n_getreg(RX65N_RIIC0_ICSR2);
          regval &= ~(RX65N_RIIC_ICSR2_STOP_SET);
          rx65n_putreg(regval, RX65N_RIIC0_ICSR2);

          regval = rx65n_getreg(RX65N_RIIC0_ICSR2);
          while (0x00 != ((regval & RX65N_RIIC_ICSR2_START_SET) || \
            (regval & RX65N_RIIC_ICSR2_STOP_SET)))
            {
              regval = rx65n_getreg(RX65N_RIIC0_ICSR2);
            }

          /* Set the internal status */

          priv->dev_sts = RIIC_STS_ST_COND_WAIT;

          /* Clear ALIE bit */

          regval = rx65n_getreg(RX65N_RIIC0_ICIER);
          regval &= ~(RX65N_RIIC_ICIER_ALIE);
          rx65n_putreg(regval, RX65N_RIIC0_ICIER);

          /* Interrupt setting */

          rx65n_riic_set_icier(priv, RX65N_RIIC_ICIER_ST_NAK_AL);

          /* Generate the start condition */

          /* Clear the start condition detection flag */

          regval = rx65n_getreg(RX65N_RIIC0_ICSR2);
          if (0x00 != ((regval & RX65N_RIIC_ICSR2_START_SET) >> 2U))
            {
              /* Clears start condition detection flag. */

              regval &= ~(RX65N_RIIC_ICSR2_START_SET);
              rx65n_putreg(regval, RX65N_RIIC0_ICSR2);
              regval = rx65n_getreg(RX65N_RIIC0_ICSR2);
            }

          /* Generate start condition */

          regval = rx65n_getreg(RX65N_RIIC0_ICCR2);
          regval |= RX65N_RIIC_ICCR2_ST_SET;
          rx65n_putreg(regval, RX65N_RIIC0_ICCR2);
          regval = rx65n_getreg(RX65N_RIIC0_ICCR2);
        }

      else
        {
          ret = RIIC_ERR_BUS_BUSY;
        }
    }

  else if (priv->bus == 1)
    {
      bus = rx65n_riic_check_bus_busy(priv);

      if (bus == RIIC_BUS_FREE)
        {
          /* Clear stop */

          regval = rx65n_getreg(RX65N_RIIC1_ICSR2);
          regval &= ~(RX65N_RIIC_ICSR2_STOP_SET);
          rx65n_putreg(regval, RX65N_RIIC1_ICSR2);

          regval = rx65n_getreg(RX65N_RIIC1_ICSR2);
          while (0x00 != ((regval & RX65N_RIIC_ICSR2_START_SET) || \
               (regval & RX65N_RIIC_ICSR2_STOP_SET)))
            {
              regval = rx65n_getreg(RX65N_RIIC1_ICSR2);
            }

