apache/nuttx/arch/renesas/src/rx65n/rx65n_riic.c
          priv->dev_sts = RIIC_STS_ST_COND_WAIT;

          regval = rx65n_getreg(RX65N_RIIC1_ICIER);
          regval &= ~(RX65N_RIIC_ICIER_ALIE);
          rx65n_putreg(regval, RX65N_RIIC1_ICIER);

          rx65n_riic_set_icier(priv, RX65N_RIIC_ICIER_ST_NAK_AL);

          regval = rx65n_getreg(RX65N_RIIC1_ICSR2);
          if (0x00 != ((regval & RX65N_RIIC_ICSR2_START_SET) >> 2U))
            {
              /* Clears start condition detection flag. */

              regval &= ~(RX65N_RIIC_ICSR2_START_SET);
              rx65n_putreg(regval, RX65N_RIIC1_ICSR2);
            }

          /* Generate start condition */

          regval = rx65n_getreg(RX65N_RIIC1_ICCR2);
          regval |= RX65N_RIIC_ICCR2_ST_SET;
          rx65n_putreg(regval, RX65N_RIIC1_ICCR2);
          regval = rx65n_getreg(RX65N_RIIC1_ICCR2);
        }

      else
        {
          ret = RIIC_ERR_BUS_BUSY;
        }
    }

  else
    {
      bus = rx65n_riic_check_bus_busy(priv);

      if (bus == RIIC_BUS_FREE)
        {
          /* Clear stop */

          regval = rx65n_getreg(RX65N_RIIC2_ICSR2);
          regval &= ~(RX65N_RIIC_ICSR2_STOP_SET);
          rx65n_putreg(regval, RX65N_RIIC2_ICSR2);

          regval = rx65n_getreg(RX65N_RIIC2_ICSR2);
          while (0x00 != ((regval & RX65N_RIIC_ICSR2_START_SET) || \
               (regval & RX65N_RIIC_ICSR2_STOP_SET)))
            {
              regval = rx65n_getreg(RX65N_RIIC2_ICSR2);
            }

          priv->dev_sts = RIIC_STS_ST_COND_WAIT;

          regval = rx65n_getreg(RX65N_RIIC2_ICIER);
          regval &= ~(RX65N_RIIC_ICIER_ALIE);
          rx65n_putreg(regval, RX65N_RIIC2_ICIER);

          /* Timeout Detection */

          rx65n_riic_set_icier(priv, RX65N_RIIC_ICIER_ST_NAK_AL);

          regval = rx65n_getreg(RX65N_RIIC2_ICSR2);
          if (0x00 != ((regval & RX65N_RIIC_ICSR2_START_SET) >> 2U))
            {
              /* Clears start condition detection flag. */

              regval &= ~(RX65N_RIIC_ICSR2_START_SET);
              rx65n_putreg(regval, RX65N_RIIC2_ICSR2);
            }

          /* Generate start condition */

          regval = rx65n_getreg(RX65N_RIIC2_ICCR2);
          regval |= RX65N_RIIC_ICCR2_ST_SET;
          rx65n_putreg(regval, RX65N_RIIC2_ICCR2);
          regval = rx65n_getreg(RX65N_RIIC2_ICCR2);
        }

      else
        {
          ret = RIIC_ERR_BUS_BUSY;
        }
    }

  return ret;
}

/****************************************************************************
 * Name: rx65n_riic_restartcond
 *
 * Description:
 *  Issue Re-start condition for Master Transmission/Reception
 *
 ****************************************************************************/

static void rx65n_riic_restartcond(FAR struct rx65n_i2c_priv_s *priv)
{
  uint8_t regval;

  if (priv->bus == 0)
    {
      /* Clears start condition detection flag. */

      regval = getreg8(RX65N_RIIC0_ICSR2);
      if (0x00 != ((regval & RX65N_RIIC_ICSR2_START_SET) >> 2U))
        {
          regval &= ~(RX65N_RIIC_ICSR2_START_SET);
          rx65n_putreg(regval, RX65N_RIIC0_ICSR2);
        }

      /* Generates a restart condition. */

      regval = getreg8(RX65N_RIIC0_ICCR2);
      regval |= RX65N_RIIC_ICCR2_RS_SET; /* Sets ICCR2.RS bit. */
      rx65n_putreg(regval, RX65N_RIIC0_ICCR2);
    }

  else if (priv->bus == 1)
    {
      /* Clears start condition detection flag. */

      regval = getreg8(RX65N_RIIC1_ICSR2);
      if (0x00 != ((regval & RX65N_RIIC_ICSR2_START_SET) >> 2U))
        {
          regval &= ~(RX65N_RIIC_ICSR2_START_SET);
          rx65n_putreg(regval, RX65N_RIIC1_ICSR2);
        }

      /* Generates a restart condition. */

      regval = getreg8(RX65N_RIIC1_ICCR2);
      regval |= RX65N_RIIC_ICCR2_RS_SET; /* Sets ICCR2.RS bit. */
      rx65n_putreg(regval, RX65N_RIIC1_ICCR2);
    }

  else
    {
      /* Clears start condition detection flag. */

      regval = getreg8(RX65N_RIIC2_ICSR2);
      if (0x00 != ((regval & RX65N_RIIC_ICSR2_START_SET) >> 2U))
        {
          regval &= ~(RX65N_RIIC_ICSR2_START_SET);
          rx65n_putreg(regval, RX65N_RIIC2_ICSR2);
        }

      /* Generates a restart condition. */

      regval = getreg8(RX65N_RIIC2_ICCR2);
      regval |= RX65N_RIIC_ICCR2_RS_SET; /* Sets ICCR2.RS bit. */
      rx65n_putreg(regval, RX65N_RIIC2_ICCR2);
    }
}

/****************************************************************************
 * Name: rx65n_riic_send_slv_addr
 *
 * Description:
 *  Transmit slave address for communication
 *
 ****************************************************************************/

static void rx65n_riic_send_slv_addr(FAR struct rx65n_i2c_priv_s *priv)
{
  uint16_t bit_addr;
  uint8_t regval;

  if (priv->msgv->flags == I2C_M_TEN)
    {
      /* 10 bit slave address handling */

      bit_addr = priv->msgv->addr;
      bit_addr &= RX65N_RIIC_10BIT_SARU_MASK;
      bit_addr >>= 8;
      regval = (uint8_t) bit_addr;

      rx65n_riic_set_sending_data(priv, regval);

      /* Check ACK/NACK reception */

      bit_addr = priv->msgv->addr;
      bit_addr &= RX65N_RIIC_10BIT_SARL_MASK;
      regval = (uint8_t) bit_addr;
    }

  else
    {
      if (priv->flags == I2C_M_READ)
        {
          priv->mode = RIIC_M_RECEIVE;
          rx65n_riic_set_icier(priv, RX65N_RIIC_ICIER_RX_NAK_AL);

          /* 7-bit slave address with READ code */

          regval = (priv->msgv->addr);
          regval <<= 1U;
          regval |= RX65N_RIIC_READ_MASK;

          priv->dev_sts = RIIC_STS_SEND_SLVADR_R_WAIT;
        }

      else
        {
          priv->mode = RIIC_M_TRANSMIT;
          rx65n_riic_set_icier(priv, RX65N_RIIC_ICIER_TEND_NAK_AL);

          /* 7-bit slave address with WRITE code */

          regval = (priv->msgv->addr);
          regval <<= 1U;
          regval &= ~(RX65N_RIIC_READ_MASK);

          priv->dev_sts = RIIC_STS_SEND_SLVADR_W_WAIT;
        }
    }

  /* Send slave address */

  rx65n_riic_set_sending_data(priv, regval);
}

/****************************************************************************
 * Name: rx65n_riic_after_send_slvadr
 *
 * Description:
 *  Processing after sending slave address
 *
 ****************************************************************************/

static void rx65n_riic_after_send_slvadr(FAR struct rx65n_i2c_priv_s *priv)
{
  uint8_t regval;
  uint8_t *data;

  if (RIIC_M_TRANSMIT == priv->mode)
    {
      /* Pattern write 1: msg[0] is memory addressand msg[1] is data byte */

      if (2U >= priv->msgc)
        {
          priv->dev_sts = RIIC_STS_SEND_DATA_WAIT;
          rx65n_riic_set_icier(priv, RX65N_RIIC_ICIER_TEND_NAK_AL);

          /* Transmit first byte (memory address) */

          if (0U != priv->dcnt)
            {
              data = priv->ptr;
              regval = *data;
              rx65n_riic_set_sending_data(priv, regval);

              priv->dcnt--;
              priv->ptr++;
            }

          else
            {
              /* Do nothing */
            }
        }

      /* Pattern write 2: msg[0] is data byte */

      else if (1U >= priv->msgc)
        {
          priv->dev_sts = RIIC_STS_SEND_DATA_WAIT;
          rx65n_riic_set_icier(priv, RX65N_RIIC_ICIER_TEND_NAK_AL);

