apache/nuttx/arch/renesas/src/rx65n/rx65n_riic.c
          /* Transmit data byte */

          if (0U != priv->dcnt)
            {
              data = priv->ptr;
              regval = *data;
              rx65n_riic_set_sending_data(priv, regval);

              priv->dcnt--;
              priv->ptr++;
            }

          else
            {
              /* Do nothing */
            }
        }

      /* Pattern write 3: transmit only slave address */

      else if (0 == priv->msgc)
        {
          priv->dev_sts = RIIC_STS_SP_COND_WAIT;
          rx65n_riic_set_icier(priv, RX65N_RIIC_ICIER_SP_NAK_AL);

          /* Generate stop condition */

          rx65n_riic_stopcond(priv);
        }

      else
        {
          /* Do nothing */
        }
    }

  if (RIIC_M_RECEIVE == priv->mode)
    {
      priv->dev_sts = RIIC_STS_RECEIVE_DATA_WAIT;

      rx65n_riic_set_icier(priv, RX65N_RIIC_ICIER_RX_NAK_AL);

      if (2 >= priv->dcnt)
        {
          rx65n_riic_wait_set(priv);
        }

      if (0x01 >= priv->dcnt)
        {
          rx65n_riic_pre_end_set(priv);
        }

      /* Dummy read */

      regval = rx65n_riic_read_data(priv);
    }
}

/****************************************************************************
 * Name: rx65n_riic_stopcond
 *
 * Description:
 *  Issue stop condition for Master Transmission/Reception
 *
 ****************************************************************************/

static void rx65n_riic_stopcond(FAR struct rx65n_i2c_priv_s *priv)
{
  uint8_t regval;

  if (priv->bus == 0)
    {
      regval = rx65n_getreg(RX65N_RIIC0_ICSR2);
      if (0x00 != ((regval & RX65N_RIIC_ICSR2_STOP_SET) >> 3U))
        {
          regval &= ~(RX65N_RIIC_ICSR2_STOP_SET);
          rx65n_putreg(regval, RX65N_RIIC0_ICSR2);
          regval = rx65n_getreg(RX65N_RIIC0_ICSR2);
        }

      /* Generates a stop condition. */

      regval = rx65n_getreg(RX65N_RIIC0_ICCR2);
      regval |= RX65N_RIIC_ICCR2_SP_SET; /* Sets ICCR2.SP bit. */
      rx65n_putreg(regval, RX65N_RIIC0_ICCR2);

      regval = rx65n_getreg(RX65N_RIIC0_ICCR2);
    }

  else if (priv->bus == 1)
    {
      /* Clears stop condition detection flag. */

      regval = rx65n_getreg(RX65N_RIIC1_ICSR2);
      if (0x00 != ((regval & RX65N_RIIC_ICSR2_STOP_SET) >> 3U))
        {
          regval &= ~(RX65N_RIIC_ICSR2_STOP_SET);
          rx65n_putreg(regval, RX65N_RIIC1_ICSR2);
        }

      /* Generates a stop condition. */

      regval = rx65n_getreg(RX65N_RIIC1_ICCR2);
      regval |= RX65N_RIIC_ICCR2_SP_SET; /* Sets ICCR2.SP bit. */
      rx65n_putreg(regval, RX65N_RIIC1_ICCR2);
    }

  else
    {
      /* Clears stop condition detection flag. */

      regval = rx65n_getreg(RX65N_RIIC2_ICSR2);
      if (0x00 != ((regval & RX65N_RIIC_ICSR2_STOP_SET) >> 3U))
        {
          regval &= ~(RX65N_RIIC_ICSR2_STOP_SET);
          rx65n_putreg(regval, RX65N_RIIC2_ICSR2);
        }

      /* Generates a stop condition. */

      regval = rx65n_getreg(RX65N_RIIC2_ICCR2);
      regval |= RX65N_RIIC_ICCR2_SP_SET; /* Sets ICCR2.SP bit. */
      rx65n_putreg(regval, RX65N_RIIC2_ICCR2);
    }
}

/****************************************************************************
 * Name: rx65n_riic_master_transmit
 *
 * Description:
 *  Transmission of data from Master to Slave
 *
 ****************************************************************************/

static void rx65n_riic_master_transmit(FAR struct rx65n_i2c_priv_s *priv)
{
  uint8_t regval;
  uint8_t *data;

  priv->dev_sts = RIIC_STS_SEND_DATA_WAIT;

  if (0U == priv->dcnt)
    {
      /* Moving to the next message */

      priv->msgc--;

      if (0x00 == priv->msgc)
        {
          rx65n_riic_set_icier(priv, RX65N_RIIC_ICIER_SP_NAK_AL);

          priv->dev_sts = RIIC_STS_SP_COND_WAIT;
          rx65n_riic_stopcond(priv);
        }

      else
        {
          priv->msgv++;
          priv->ptr = priv->msgv->buffer;
          priv->flags = priv->msgv->flags;
          priv->dcnt = priv->msgv->length;

          if (priv->flags == I2C_M_READ)
            {
              priv->mode = RIIC_M_RECEIVE;
              priv->event = RIIC_EV_GEN_START_COND;

              rx65n_riic_set_icier(priv, RX65N_RIIC_ICIER_ST_NAK_AL);

              rx65n_riic_restartcond(priv);
            }
        }
    }

  if (0U != priv->dcnt && priv->flags != I2C_M_READ)
    {
      rx65n_riic_set_icier(priv, RX65N_RIIC_ICIER_TEND_NAK_AL);

      data = priv->ptr;
      regval = *data;

      /* send the byte */

      rx65n_riic_set_sending_data(priv, regval);

      /* decrement the count */

      priv->dcnt--;
      priv->ptr++;
    }
}

/****************************************************************************
 * Name: rx65n_riic_read_data
 *
 * Description:
 *  Read received data from ICDRR
 *
 ****************************************************************************/

static uint8_t rx65n_riic_read_data(FAR struct rx65n_i2c_priv_s *priv)
{
  volatile uint8_t * regval;

  if (0 == priv->bus)
    {
      regval = (uint8_t *) (RX65N_RIIC0_ICDRR);
    }

  else if (1 == priv->bus)
    {
      regval = (uint8_t *) (RX65N_RIIC1_ICDRR);
    }

  else
    {
      regval = (uint8_t *) (RX65N_RIIC2_ICDRR);
    }

  return *regval;
}

/****************************************************************************
 * Name: rx65n_riic_wait_set
 *
 * Description:
 *  Receive "last byte - 2bytes" Setting Proccesing.
 *  Sets ICMR3.WAIT bit.
 *
 ****************************************************************************/

static void rx65n_riic_wait_set(FAR struct rx65n_i2c_priv_s *priv)
{
  uint8_t regval;

  if (0 == priv->bus)
    {
#ifdef CONFIG_RX65N_RIIC0_RCV_IN_BYTE_UNITS
      regval = rx65n_getreg(RX65N_RIIC0_ICMR3);
      regval |= RX65N_RIIC_ICMR3_WAIT_SET;
      rx65n_putreg(regval, RX65N_RIIC0_ICMR3);
      regval = rx65n_getreg(RX65N_RIIC0_ICMR3);
#endif
    }

  else if (1 == priv->bus)
    {
#ifdef CONFIG_RX65N_RIIC1_RCV_IN_BYTE_UNITS
      regval = rx65n_getreg(RX65N_RIIC1_ICMR3);
      regval |= RX65N_RIIC_ICMR3_WAIT_SET;
      rx65n_putreg(regval, RX65N_RIIC1_ICMR3);
      regval = rx65n_getreg(RX65N_RIIC1_ICMR3);
#endif
    }

  else
    {
#ifdef CONFIG_RX65N_RIIC2_RCV_IN_BYTE_UNITS
      regval = rx65n_getreg(RX65N_RIIC2_ICMR3);
      regval |= RX65N_RIIC_ICMR3_WAIT_SET;
      rx65n_putreg(regval, RX65N_RIIC2_ICMR3);
      regval = rx65n_getreg(RX65N_RIIC2_ICMR3);
#endif
    }
}

/****************************************************************************
 * Name: rx65n_riic_pre_end_set
 *
 * Description:
 *  Receive "last byte - 1byte" Setting Processing.
 *  Sets ICMR3.RDRFS bit and ACKBT bit.
 *
 ****************************************************************************/

static void rx65n_riic_pre_end_set(FAR struct rx65n_i2c_priv_s *priv)
{
  if (0 == priv->bus)
    {
#ifdef CONFIG_RX65N_RIIC0_RCV_IN_BYTE_UNITS
      RIIC0.ICMR3.BIT.RDRFS = 1;
#endif
      RIIC0.ICMR3.BIT.ACKWP = 1;
      RIIC0.ICMR3.BIT.ACKBT = 1;
      RIIC0.ICMR3.BIT.ACKWP = 0;

      (void)rx65n_getreg(RX65N_RIIC0_ICMR3);
    }

  else if (1 == priv->bus)
    {
#ifdef CONFIG_RX65N_RIIC1_RCV_IN_BYTE_UNITS
      RIIC1.ICMR3.BIT.RDRFS = 1;
#endif
      RIIC1.ICMR3.BIT.ACKWP = 1;
      RIIC1.ICMR3.BIT.ACKBT = 1;
      RIIC1.ICMR3.BIT.ACKWP = 0;

      (void)rx65n_getreg(RX65N_RIIC1_ICMR3);
    }

  else
    {
#ifdef CONFIG_RX65N_RIIC2_RCV_IN_BYTE_UNITS
      RIIC2.ICMR3.BIT.RDRFS = 1;
#endif
      RIIC2.ICMR3.BIT.ACKWP = 1;
      RIIC2.ICMR3.BIT.ACKBT = 1;
      RIIC2.ICMR3.BIT.ACKWP = 0;

