apache/nuttx/arch/renesas/src/rx65n/rx65n_riic.c
      (void)rx65n_getreg(RX65N_RIIC2_ICMR3);
    }
}

/****************************************************************************
 * Name: rx65n_riic_end_set
 *
 * Description:
 *  Receive End Setting Processing.
 *  Sets ICMR3.ACKBT bit and clears ICMR3.WAIT bit.
 *
 ****************************************************************************/

static void rx65n_riic_end_set(FAR struct rx65n_i2c_priv_s *priv)
{
  if (0 == priv->bus)
    {
      RIIC0.ICMR3.BIT.ACKWP = 1;
      RIIC0.ICMR3.BIT.ACKBT = 1;
      RIIC0.ICMR3.BIT.ACKWP = 0;
#ifdef CONFIG_RX65N_RIIC0_RCV_IN_BYTE_UNITS
      RIIC0.ICMR3.BIT.WAIT = 0;
#endif

      rx65n_getreg(RX65N_RIIC0_ICMR3);
    }

  else if (1 == priv->bus)
    {
      RIIC1.ICMR3.BIT.ACKWP = 1;
      RIIC1.ICMR3.BIT.ACKBT = 1;
      RIIC1.ICMR3.BIT.ACKWP = 0;
#ifdef CONFIG_RX65N_RIIC1_RCV_IN_BYTE_UNITS
      RIIC1.ICMR3.BIT.WAIT = 0;
#endif

      rx65n_getreg(RX65N_RIIC1_ICMR3);
    }

  else
    {
      RIIC2.ICMR3.BIT.ACKWP = 1;
      RIIC2.ICMR3.BIT.ACKBT = 1;
      RIIC2.ICMR3.BIT.ACKWP = 0;
#ifdef CONFIG_RX65N_RIIC2_RCV_IN_BYTE_UNITS
      RIIC2.ICMR3.BIT.WAIT = 0;
#endif

      rx65n_getreg(RX65N_RIIC2_ICMR3);
    }
}

/****************************************************************************
 * Name: rx65n_riic_master_receive
 *
 * Description:
 *  Transmission of data from Master to Slave
 *
 ****************************************************************************/

static void rx65n_riic_master_receive(FAR struct rx65n_i2c_priv_s *priv)
{
  uint8_t regval;
  priv->dev_sts = RIIC_STS_RECEIVE_DATA_WAIT;

  /* The period between the ninth clock cycle and the first clock cycle
   * is held low. Low-hold is released by reading the ICDRR register.
   */

  if (0x03 >= priv->dcnt)
    {
      rx65n_riic_wait_set(priv);
    }

  if (0x02 >= priv->dcnt)
    {
      rx65n_riic_pre_end_set(priv);
    }

  if (0x01 >= priv->dcnt)
    {
      rx65n_riic_set_icier(priv, RX65N_RIIC_ICIER_SP_NAK_AL);

      priv->dev_sts = RIIC_STS_SP_COND_WAIT;
      rx65n_riic_stopcond(priv);

      if (0x00 != priv->dcnt)
        {
          regval = rx65n_riic_read_data(priv);
          *(priv->msgv->buffer) = regval;
          priv->msgv->buffer++;
          *(priv->ptr) = regval;
          priv->dcnt--;
        }

      else
        {
          regval = rx65n_riic_read_data(priv);
        }

      rx65n_riic_end_set(priv);
    }

  else
    {
      regval = rx65n_riic_read_data(priv);
      *(priv->msgv->buffer) = regval;
      priv->msgv->buffer++;
      *(priv->ptr) = regval;
      priv->dcnt--;
    }
}

/****************************************************************************
 * Name: rx65n_riic_rxi0interrupt
 *
 * Description:
 *  Interrupt RIIC0 RXI0 handler – Received Data Full Interrupt Handler
 *
 * Occurs under following conditions:
 *  - Address/data transmission completed in Master Receive Mode
 *  - Reception of (last data – 1) completed in Master Receive Mode
 *  - Reception of last data completed in Master Receive Mode
 *
 ****************************************************************************/

static int rx65n_riic_rxi0interrupt(int irq, FAR void *context, \
                                      FAR void *arg)
{
  FAR struct rx65n_i2c_priv_s *priv = (struct rx65n_i2c_priv_s *)arg;

  priv->event = RIIC_EV_INT_RECEIVE;

  rx65n_riic_advance(priv);
  return OK;
}

/****************************************************************************
 * Name: rx65n_riic_rxi1interrupt
 *
 * Description:
 *  Interrupt RIIC1 RXI1 handler – Received Data Full Interrupt Handler
 *
 * Occurs under following conditions:
 *  - Address/data transmission completed in Master Receive Mode
 *  - Reception of (last data – 1) completed in Master Receive Mode
 *  - Reception of last data completed in Master Receive Mode
 *
 ****************************************************************************/

static int rx65n_riic_rxi1interrupt(int irq, FAR void *context, \
                                                  FAR void *arg)
{
  FAR struct rx65n_i2c_priv_s *priv = (struct rx65n_i2c_priv_s *)arg;

  priv->event = RIIC_EV_INT_RECEIVE;

  rx65n_riic_advance(priv);
  return OK;
}

/****************************************************************************
 * Name: rx65n_i2c_rxi2interrupt
 *
 * Description:
 *  Interrupt RIIC2 RXI2 handler – Received Data Full Interrupt Handler
 *
 * Occurs under following conditions:
 *  - Address/data transmission completed in Master Receive Mode
 *  - Reception of (last data – 1) completed in Master Receive Mode
 *  - Reception of last data completed in Master Receive Mode
 *
 ****************************************************************************/

static int rx65n_riic_rxi2interrupt(int irq, FAR void *context, \
                                        FAR void *arg)
{
  FAR struct rx65n_i2c_priv_s *priv = (struct rx65n_i2c_priv_s *)arg;
  priv->event = RIIC_EV_INT_RECEIVE;

  rx65n_riic_advance(priv);
  return OK;
}

/****************************************************************************
 * Name: rx65n_riic_txi0interrupt
 *
 * Description:
 *  Interrupt RIIC0 TXI0 handler – Transmit Data Empty Interrupt Handler
 *
 * Occurs under following conditions:
 *  - Transmit Buffer is empty
 *
 ****************************************************************************/

static int rx65n_riic_txi0interrupt(int irq, FAR void *context, \
                                       FAR void *arg)
{
  FAR struct rx65n_i2c_priv_s *priv = (struct rx65n_i2c_priv_s *)arg;

  /* Ideally, should never get here as this interrupt only occurs during
   * Multi-master mode of operation and
   * Slave transmission/recption mode
   */

  priv->event = RIIC_EV_INT_TXI;

  rx65n_riic_advance(priv);
  return OK;
}

/****************************************************************************
 * Name: rx65n_riic_txi1interrupt
 *
 * Description:
 *  Interrupt RIIC1 TXI1 handler – Transmit Data Empty Interrupt Handler
 *
 * Occurs under following conditions:
 *  - Transmit Buffer is empty
 *
 ****************************************************************************/

static int rx65n_riic_txi1interrupt(int irq, FAR void *context, \
                                         FAR void *arg)
{
  FAR struct rx65n_i2c_priv_s *priv = (struct rx65n_i2c_priv_s *)arg;

  /* Ideally, should never get here as this interrupt only occurs during
   * Multi-master mode of operation and
   * Slave transmission/recption mode
   */

  priv->event = RIIC_EV_INT_TXI;

  rx65n_riic_advance(priv);
  return OK;
}

/****************************************************************************
 * Name: rx65n_riic_txi2interrupt
 *
 * Description:
 *  Interrupt RIIC2 TXI2 handler – Transmit Data Empty Interrupt Handler
 *
 * Occurs under following conditions:
 *  - Transmit Buffer is empty
 *
 ****************************************************************************/

static int rx65n_riic_txi2interrupt(int irq, FAR void *context, \
                                       FAR void *arg)
{
  FAR struct rx65n_i2c_priv_s *priv = (struct rx65n_i2c_priv_s *)arg;

  /* Ideally, should never get here as this interrupt only occurs during
   * Multi-master mode of operation and
   * Slave transmission/recption mode
   */

  priv->event = RIIC_EV_INT_TXI;

  rx65n_riic_advance(priv);
  return OK;
}

/****************************************************************************
 * Name: rx65n_riic_tei0interrupt
 *
 * Description:
 *  Interrupt RIIC0 TEI0 handler – Transmission End Interrupt Handler
 *
 * Occurs under following conditions:
 *  - Address/data transmission completed
 *
 ****************************************************************************/

