apache/nuttx/arch/renesas/src/rx65n/rx65n_riic.c
static int rx65n_riic_tei0interrupt(int irq, FAR void *context, \
                                    FAR void *arg)
{
  FAR struct rx65n_i2c_priv_s *priv = (struct rx65n_i2c_priv_s *)arg;

  RIIC0.ICSR2.BIT.TEND = 0U;
  while (0U != RIIC0.ICSR2.BIT.TEND)
    {
      /* Do Nothing */
    }

  if ((RIIC_STS_SEND_SLVADR_W_WAIT == priv->dev_sts) ||
     (RIIC_STS_SEND_SLVADR_R_WAIT == priv->dev_sts))
    {
      /* Sets interrupted address sending - slave address transmitted */

      priv->event = RIIC_EV_INT_ADD;
    }

  else if (RIIC_STS_SEND_DATA_WAIT == priv->dev_sts)
    {
      /* Sets interrupted data sending */

      priv->event = RIIC_EV_INT_SEND;
    }

  rx65n_riic_advance(priv);
  return OK;
}

/****************************************************************************
 * Name: rx65n_riic_tei1interrupt
 *
 * Description:
 *  Interrupt RIIC1 TEI1 handler – Transmission End Interrupt Handler
 *
 * Occurs under following conditions:
 *  - Address/data transmission completed
 *
 ****************************************************************************/

static int rx65n_riic_tei1interrupt(int irq, FAR void *context, \
                                    FAR void *arg)
{
  FAR struct rx65n_i2c_priv_s *priv = (struct rx65n_i2c_priv_s *)arg;

  RIIC1.ICSR2.BIT.TEND = 0U;
  while (0U != RIIC1.ICSR2.BIT.TEND)
    {
      /* Do Nothing */
    }

  if ((RIIC_STS_SEND_SLVADR_W_WAIT == priv->dev_sts) ||
     (RIIC_STS_SEND_SLVADR_R_WAIT == priv->dev_sts))
    {
      priv->event = RIIC_EV_INT_ADD;
    }

  else if (RIIC_STS_SEND_DATA_WAIT == priv->dev_sts)
    {
      priv->event = RIIC_EV_INT_SEND;
    }

  rx65n_riic_advance(priv);
  return OK;
}

/****************************************************************************
 * Name: rx65n_riic_tei2interrupt
 *
 * Description:
 *  Interrupt RIIC2 TEI2 handler – Transmission End Interrupt Handler
 *
 * Occurs under following conditions:
 * - Address/data transmission completed
 *
 ****************************************************************************/

static int rx65n_riic_tei2interrupt(int irq, FAR void *context, \
                                    FAR void *arg)
{
  FAR struct rx65n_i2c_priv_s *priv = (struct rx65n_i2c_priv_s *)arg;

  RIIC2.ICSR2.BIT.TEND = 0U;
  while (0U != RIIC2.ICSR2.BIT.TEND)
    {
      /* Do Nothing */
    }

  if ((RIIC_STS_SEND_SLVADR_W_WAIT == priv->dev_sts) ||
     (RIIC_STS_SEND_SLVADR_R_WAIT == priv->dev_sts))
    {
      priv->event = RIIC_EV_INT_ADD;
    }

  else if (RIIC_STS_SEND_DATA_WAIT == priv->dev_sts)
    {
      priv->event = RIIC_EV_INT_SEND;
    }

  rx65n_riic_advance(priv);
  return OK;
}

/****************************************************************************
 * Name: rx65n_riic_eei0interrupt
 *
 * Description:
 *  Interrupt RIIC0 EEI0 handler – Event/Error Generation Interrupt Handler
 *
 * Occurs under following conditions:
 *  - START condition detected
 *  - RESTART condition detected
 *  - STOP condition detected
 *  - NACK detected
 *  - AL (arbitration-lost) detected
 *  - TMO (timeout detection)
 *
 ****************************************************************************/

static int rx65n_riic_eei0interrupt(int irq, FAR void *context, \
                                    FAR void *arg)
{
  FAR struct rx65n_i2c_priv_s *priv = (struct rx65n_i2c_priv_s *)arg;

  /* Check Timeout Condition */

  if ((0U != RIIC0.ICSR2.BIT.TMOF) && (0U != RIIC0.ICIER.BIT.TMOIE))
    {
      RIIC0.ICIER.BIT.TMOIE = 0U;
      while (0U != RIIC0.ICIER.BIT.TMOIE)
        {
          /* Wait for reset to complete */
        }

      priv->event = RIIC_EV_INT_TMO;
    }

  /* Check Arbitration-Lost Condition */

  if ((0U != RIIC0.ICSR2.BIT.AL) && (0U != RIIC0.ICIER.BIT.ALIE))
    {
      RIIC0.ICIER.BIT.ALIE = 0U;
      while (0U != RIIC0.ICIER.BIT.ALIE)
        {
          /* Do Nothing */
        }

      priv->event = RIIC_EV_INT_AL;
    }

  /* Check Stop Condition */

  if ((0U != RIIC0.ICSR2.BIT.STOP) && (0U != RIIC0.ICIER.BIT.SPIE))
    {
      RIIC0.ICIER.BIT.SPIE = 0U;

      RIIC0.ICMR3.BIT.RDRFS = 0U;
      RIIC0.ICMR3.BIT.ACKWP = 1U;
      RIIC0.ICMR3.BIT.ACKBT = 0U;
      RIIC0.ICMR3.BIT.ACKWP = 0U;

      while ((0U != RIIC0.ICMR3.BIT.RDRFS) || \
        (0U != RIIC0.ICMR3.BIT.ACKBT))
        {
          /* Do Nothing */
        }

      RIIC0.ICSR2.BIT.STOP = 0U;
      while (0U != RIIC0.ICSR2.BIT.STOP)
        {
          /* Do Nothing */
        }

      priv->event = RIIC_EV_INT_STOP;
    }

  /* Check NACK reception. */

  if ((0U != RIIC0.ICSR2.BIT.NACKF) && (0U != RIIC0.ICIER.BIT.NAKIE))
    {
      /* Prohibits NACK interrupt to generate stop condition. */

      RIIC0.ICIER.BIT.NAKIE = 0U;

      /* Prohibits these interrupt.
       * After NACK interrupt, these interrupts will occur
       * when they do not stop the following interrupts.
       */

      RIIC0.ICIER.BIT.TEIE = 0U;
      RIIC0.ICIER.BIT.TIE = 0U;
      RIIC0.ICIER.BIT.RIE = 0U;

      while (((0U != RIIC0.ICIER.BIT.TEIE) || \
        (0U != RIIC0.ICIER.BIT.TIE)) || (0U != RIIC0.ICIER.BIT.RIE))
        {
          /* Do Nothing */
        }

      if (0U == RIIC0.ICCR2.BIT.TRS)
        {
          IR(RIIC0, RXI0) = 0;
        }

      priv->event = RIIC_EV_INT_NACK;
    }

  /* Check Start condition detection. */

  if ((0U != RIIC0.ICSR2.BIT.START) && (0U != RIIC0.ICIER.BIT.STIE))
    {
      RIIC0.ICIER.BIT.STIE = 0U;
      RIIC0.ICSR2.BIT.START = 0U;
      while ((0U != RIIC0.ICSR2.BIT.START) || \
       (0U != RIIC0.ICIER.BIT.STIE))
        {
          /* Wait till reset is completed */
        }

      /* Sets event flag. */

      priv->event = RIIC_EV_INT_START;
    }

  rx65n_riic_advance(priv);
  return OK;
}

/****************************************************************************
 * Name: rx65n_riic_eei1interrupt
 *
 * Description:
 *  Interrupt RIIC1 EEI1 handler – Event/Error Generation Interrupt Handler
 *
 * Occurs under following conditions:
 *  - START condition detected
 *  - RESTART condition detected
 *  - STOP condition detected
 *  - NACK detected
 *  - AL (arbitration-lost) detected
 *  - TMO (timeout detection)
 *
 ****************************************************************************/

static int rx65n_riic_eei1interrupt(int irq, FAR void *context, \
                                    FAR void *arg)
{
  FAR struct rx65n_i2c_priv_s *priv = (struct rx65n_i2c_priv_s *)arg;

