apache/nuttx/arch/renesas/src/rx65n/rx65n_riic.c
  /* Check Timeout Condition */

  if ((0U != RIIC1.ICSR2.BIT.TMOF) && (0U != RIIC1.ICIER.BIT.TMOIE))
    {
      RIIC1.ICIER.BIT.TMOIE = 0U;
      while (0U != RIIC1.ICIER.BIT.TMOIE)
        {
          /* Wait for reset to complete */
        }

      priv->event = RIIC_EV_INT_TMO;
    }

  /* Check Arbitration-Lost Condition */

  if ((0U != RIIC1.ICSR2.BIT.AL) && (0U != RIIC1.ICIER.BIT.ALIE))
    {
      RIIC1.ICIER.BIT.ALIE = 0U;
      while (0U != RIIC1.ICIER.BIT.ALIE)
        {
          /* Do Nothing */
        }

      priv->event = RIIC_EV_INT_AL;
    }

  /* Check Stop Condition */

  if ((0U != RIIC1.ICSR2.BIT.STOP) && (0U != RIIC1.ICIER.BIT.SPIE))
    {
      RIIC1.ICIER.BIT.SPIE = 0U;
      RIIC1.ICMR3.BIT.RDRFS = 0U;
      RIIC1.ICMR3.BIT.ACKWP = 1U;
      RIIC1.ICMR3.BIT.ACKBT = 0U;
      RIIC1.ICMR3.BIT.ACKWP = 0U;

      while ((0U != RIIC1.ICMR3.BIT.RDRFS) || \
          (0U != RIIC1.ICMR3.BIT.ACKBT))
        {
          /* Do Nothing */
        }

      RIIC1.ICSR2.BIT.STOP = 0U;
      while (0U != RIIC1.ICSR2.BIT.STOP)
        {
          /* Do Nothing */
        }

      priv->event = RIIC_EV_INT_STOP;
    }

  /* Check NACK reception. */

  if ((0U != RIIC1.ICSR2.BIT.NACKF) && (0U != RIIC1.ICIER.BIT.NAKIE))
    {
      /* Prohibits NACK interrupt to generate stop condition. */

      RIIC1.ICIER.BIT.NAKIE = 0U;

      /* Prohibits these interrupt.
       * After NACK interrupt, these interrupts will occur
       * when they do not stop the following interrupts.
       */

      RIIC1.ICIER.BIT.TEIE = 0U;
      RIIC1.ICIER.BIT.TIE = 0U;
      RIIC1.ICIER.BIT.RIE = 0U;

      while (((0U != RIIC1.ICIER.BIT.TEIE) || \
          (0U != RIIC1.ICIER.BIT.TIE)) || (0U != RIIC1.ICIER.BIT.RIE))
        {
          /* Do Nothing */
        }

      if (0U == RIIC1.ICCR2.BIT.TRS)
        {
          IR(RIIC1, RXI1) = 0;
        }

      priv->event = RIIC_EV_INT_NACK;
    }

  /* Check Start condition detection. */

  if ((0U != RIIC1.ICSR2.BIT.START) && (0U != RIIC1.ICIER.BIT.STIE))
    {
      RIIC1.ICIER.BIT.STIE = 0U;
      RIIC1.ICSR2.BIT.START = 0U;
      while ((0U != RIIC1.ICSR2.BIT.START) || (0U != RIIC1.ICIER.BIT.STIE))
        {
          /* Wait till reset is completed */
        }

      priv->event = RIIC_EV_INT_START;
    }

  rx65n_riic_advance(priv);
  return OK;
}

/****************************************************************************
 * Name: rx65n_riic_eei2interrupt
 *
 * Description:
 *  Interrupt RIIC2 EEI2 handler – Event/Error Generation Interrupt Handler
 *
 * Occurs under following conditions:
 *  - START condition detected
 *  - RESTART condition detected
 *  - STOP condition detected
 *  - NACK detected
 *  - AL (arbitration-lost) detected
 *  - TMO (timeout detection)
 *
 ****************************************************************************/

static int rx65n_riic_eei2interrupt(int irq, FAR void *context, \
                                    FAR void *arg)
{
  FAR struct rx65n_i2c_priv_s *priv = (struct rx65n_i2c_priv_s *)arg;

  /* Check Timeout Condition */

  if ((0U != RIIC2.ICSR2.BIT.TMOF) && (0U != RIIC2.ICIER.BIT.TMOIE))
    {
      RIIC2.ICIER.BIT.TMOIE = 0U;
      while (0U != RIIC2.ICIER.BIT.TMOIE)
        {
          /* Wait for reset to complete */
        }

      priv->event = RIIC_EV_INT_TMO;
    }

  /* Check Arbitration-Lost Condition */

  if ((0U != RIIC2.ICSR2.BIT.AL) && (0U != RIIC2.ICIER.BIT.ALIE))
    {
      RIIC2.ICIER.BIT.ALIE = 0U;
      while (0U != RIIC2.ICIER.BIT.ALIE)
        {
          /* Do Nothing */
        }

      priv->event = RIIC_EV_INT_AL;
    }

  /* Check Stop Condition */

  if ((0U != RIIC2.ICSR2.BIT.STOP) && (0U != RIIC2.ICIER.BIT.SPIE))
    {
      RIIC2.ICIER.BIT.SPIE = 0U;

      RIIC2.ICMR3.BIT.RDRFS = 0U;
      RIIC2.ICMR3.BIT.ACKWP = 1U;
      RIIC2.ICMR3.BIT.ACKBT = 0U;
      RIIC2.ICMR3.BIT.ACKWP = 0U;

      while ((0U != RIIC2.ICMR3.BIT.RDRFS) || \
        (0U != RIIC2.ICMR3.BIT.ACKBT))
        {
          /* Do Nothing */
        }

      RIIC2.ICSR2.BIT.STOP = 0U;
      while (0U != RIIC2.ICSR2.BIT.STOP)
        {
          /* Do Nothing */
        }

      priv->event = RIIC_EV_INT_STOP;
    }

  /* Check NACK reception. */

  if ((0U != RIIC2.ICSR2.BIT.NACKF) && (0U != RIIC2.ICIER.BIT.NAKIE))
    {
      /* Prohibits NACK interrupt to generate stop condition. */

      RIIC2.ICIER.BIT.NAKIE = 0U;

      /* Prohibits these interrupt.
       * After NACK interrupt, these interrupts will occur
       * when they do not stop the following interrupts.
       */

      RIIC2.ICIER.BIT.TEIE = 0U;
      RIIC2.ICIER.BIT.TIE = 0U;
      RIIC2.ICIER.BIT.RIE = 0U;

      while (((0U != RIIC2.ICIER.BIT.TEIE) || \
        (0U != RIIC2.ICIER.BIT.TIE)) || (0U != RIIC2.ICIER.BIT.RIE))
        {
          /* Do Nothing */
        }

      if (0U == RIIC2.ICCR2.BIT.TRS)
        {
          IR(RIIC2, RXI2) = 0;
        }

      priv->event = RIIC_EV_INT_NACK;
    }

  /* Check Start condition detection. */

  if ((0U != RIIC2.ICSR2.BIT.START) && (0U != RIIC2.ICIER.BIT.STIE))
    {
      RIIC2.ICIER.BIT.STIE = 0U;
      RIIC2.ICSR2.BIT.START = 0U;
      while ((0U != RIIC2.ICSR2.BIT.START) || \
       (0U != RIIC2.ICIER.BIT.STIE))
        {
          /* Wait till reset is completed */
        }

      priv->event = RIIC_EV_INT_START;
    }

  rx65n_riic_advance(priv);
  return OK;
}

/****************************************************************************
 * Name: rx65n_i2c_transfer
 *
 * Description:
 *   This function initializes the RIIC channel
 *
 ****************************************************************************/

static int rx65n_i2c_transfer(FAR struct i2c_master_s *dev, \
            FAR struct i2c_msg_s *msgs, int count)
{
  FAR struct rx65n_i2c_priv_s *priv = (struct rx65n_i2c_priv_s *)dev;
  int ret = 0;

  DEBUGASSERT(dev != NULL && msgs != NULL && count > 0);

  /* Get exclusive access to the I2C bus */

  nxsem_wait(&priv->sem_excl);

  priv->mode = RIIC_READY;
  priv->dev_sts = RIIC_STS_IDLE;
  priv->event = RIIC_EV_NONE;

  priv->dcnt = 0;
  priv->ptr = NULL;

