apache/nuttx/arch/renesas/src/rx65n/rx65n_riic.c
  priv->msgv = msgs;
  priv->msgc = count;

  priv->ptr = priv->msgv->buffer;
  priv->dcnt = priv->msgv->length;
  priv->flags = priv->msgv->flags;

  /* Set reference clock for I2C bus */

  rx65n_riic_setclock(priv, msgs->frequency);

  if ((priv->flags == 0) || (priv->flags == I2C_M_NOSTOP)
     || (priv->flags == I2C_M_TEN))
    {
      /* MASTER TRANSMISSION MODE
       * No communication is in progress
       * Initiate START condition and proceed with transfer
       */

      if (priv->mode == RIIC_READY)
        {
          /* Device is ready for communication */

          priv->event = RIIC_EV_GEN_START_COND;
          ret = rx65n_riic_startcond(priv);
          if (ret == RIIC_ERR_BUS_BUSY)
            {
              priv->mode = RIIC_NONE;
              priv->dev_sts = RIIC_STS_NO_INIT;
              priv->event = RIIC_EV_NONE;

              /* Disable interrupts */

              rx65n_riic_int_disable(priv);
            }
        }
    }

  else if (priv->flags == I2C_M_READ)
    {
      /* MASTER RECEPTION MODE
       * No communication is in progress
       * Initiate START condition and proceed with transfer
       */

      if (priv->mode == RIIC_READY)
        {
          /* Device is ready for communication */

          priv->event = RIIC_EV_GEN_START_COND;
          ret = rx65n_riic_startcond(priv);
          if (ret == RIIC_ERR_BUS_BUSY)
            {
              priv->mode = RIIC_NONE;
              priv->dev_sts = RIIC_STS_NO_INIT;
              priv->event = RIIC_EV_NONE;

              /* Disable interrupts */

              rx65n_riic_int_disable(priv);
            }
        }
    }

  else if (priv->flags == I2C_M_NOSTART)
    {
      /* COMMUNICATION IS IN PROGRESS */

      if (priv->mode == RIIC_M_TRANSMIT)
        {
          priv->ptr = priv->msgv->buffer;
          priv->dcnt = priv->msgv->length;
          rx65n_riic_master_transmit(priv);
        }

      else if (priv->mode == RIIC_M_RECEIVE)
        {
          rx65n_riic_master_receive(priv);
        }
    }

  nxsem_post(&priv->sem_excl);

  while (RIIC_FINISH != priv->mode && RIIC_NONE != priv->mode);

  if (0 == priv->bus)
    {
      if (1U == RIIC0.ICSR2.BIT.NACKF)
        {
          ret = -ENXIO;
        }

      else if ((1U == RIIC0.ICCR2.BIT.BBSY) || (RIIC_ERR_BUS_BUSY == ret))
        {
          ret = -EBUSY;
        }

      else
        {
          ret = RIIC_SUCCESS;
        }
    }

  else if (1 == priv->bus)
    {
      if (1U == RIIC1.ICSR2.BIT.NACKF)
        {
          ret = -ENXIO;
        }

      else if ((1U == RIIC1.ICCR2.BIT.BBSY) || (RIIC_ERR_BUS_BUSY == ret))
        {
          ret = -EBUSY;
        }

      else
        {
          ret = RIIC_SUCCESS;
        }
    }

  else
    {
      if (1U == RIIC2.ICSR2.BIT.NACKF)
        {
          ret = -ENXIO;
        }

      else if ((1U == RIIC2.ICCR2.BIT.BBSY) || (RIIC_ERR_BUS_BUSY == ret))
        {
          ret = -EBUSY;
        }

      else
        {
          ret = RIIC_SUCCESS;
        }
    }

  rx65n_riic_iicrst(priv);
  return ret;
}

/****************************************************************************
 * Name: rx65n_i2c_reset
 *
 * Description:
 *   Resets the RIIC channel
 *
 ****************************************************************************/

#ifdef CONFIG_I2C_RESET
static int rx65n_i2c_reset(FAR struct i2c_master_s *dev)
{
  FAR struct rx65n_i2c_priv_s *priv = (struct rx65n_i2c_priv_s *)dev;
  uint8_t regval;

  DEBUGASSERT(dev);

  DEBUGASSERT(priv->refs > 0);

  nxsem_wait(&priv->sem_excl);

  if (priv->bus == 0)
    {
      regval = rx65n_getreg(RX65N_RIIC0_ICCR1);
      regval |= RX65N_RIIC_ICCR1_IICRST_SET; /* ICCR1.IICRST bit to 1. */
      rx65n_putreg(regval, RX65N_RIIC0_ICCR1);
      regval = rx65n_getreg(RX65N_RIIC0_ICCR1);

      regval = rx65n_getreg(RX65N_RIIC0_ICCR1);
      regval &= ~(RX65N_RIIC_ICCR1_IICRST_SET); /* ICCR1.IICRST bit to 0. */
      rx65n_putreg(regval, RX65N_RIIC0_ICCR1);
      regval = rx65n_getreg(RX65N_RIIC0_ICCR1);
    }

  else if (priv->bus == 1)
    {
      regval = rx65n_getreg(RX65N_RIIC1_ICCR1);
      regval |= RX65N_RIIC_ICCR1_IICRST_SET; /* ICCR1.IICRST bit to 1. */
      rx65n_putreg(regval, RX65N_RIIC1_ICCR1);

      regval = rx65n_getreg(RX65N_RIIC1_ICCR1);
      regval &= ~(RX65N_RIIC_ICCR1_IICRST_SET); /* ICCR1.IICRST bit to 0. */
      rx65n_putreg(regval, RX65N_RIIC1_ICCR1);
    }

  else
    {
      regval = rx65n_getreg(RX65N_RIIC2_ICCR1);
      regval |= RX65N_RIIC_ICCR1_IICRST_SET; /* ICCR1.IICRST bit to 1. */
      rx65n_putreg(regval, RX65N_RIIC2_ICCR1);

      regval = rx65n_getreg(RX65N_RIIC2_ICCR1);
      regval &= ~(RX65N_RIIC_ICCR1_IICRST_SET); /* ICCR1.IICRST bit to 0. */
      rx65n_putreg(regval, RX65N_RIIC2_ICCR1);
    }

  nxsem_post(&priv->sem_excl);
  return OK;
}
#endif /* CONFIG_I2C_RESET */

/****************************************************************************
 * Name: rx65n_i2cbus_initialize
 *
 * Description:
 *   This function initializes the RIIC channel
 *
 ****************************************************************************/

FAR struct i2c_master_s *rx65n_i2cbus_initialize(int channel)
{
  struct rx65n_i2c_priv_s * priv = NULL;
  irqstate_t irqs;

  /* Get I2C private structure */

  i2cinfo("RX65N RIIC Bus Initialization:\n");
  riic_mpc_enable();
  switch (channel)
    {
#ifdef CONFIG_RX65N_RIIC0
      case 0:
        riic0_init_port();
        i2cinfo("RX65N RIIC0 Channel Initial Setup\n");
        priv = (struct rx65n_i2c_priv_s *)&rx65n_riic0_priv;
        break;
#endif
#ifdef CONFIG_RX65N_RIIC1
      case 1:
        riic1_init_port();
        i2cinfo("RX65N RIIC1 Channel Initial Setup\n");
        priv = (struct rx65n_i2c_priv_s *)&rx65n_riic1_priv;
        break;
#endif
#ifdef CONFIG_RX65N_RIIC2
      case 2:
        riic2_init_port();
        i2cinfo("RX65N RIIC2 Channel Initial Setup\n");
        priv = (struct rx65n_i2c_priv_s *)&rx65n_riic2_priv;
        break;
#endif
      default:
        i2cerr("Channel %d is not supported by RX65N\n", channel);
        riic_mpc_disable();
        return NULL;
    }

  /* Initialize private data for the first time, increment reference count,
   * initialize RIIC registers and attach IRQs
   */

  irqs = enter_critical_section();

  if ((volatile int)priv->refs++ == 0)
    {
      /* Initialize semaphores */

      nxsem_init(&priv->sem_excl, 0, 1);
      nxsem_init(&priv->sem_isr, 0, 0);

      /* Initialize the RIIC registers */

      rx65n_riic_init(priv);
    }

  leave_critical_section(irqs);
  riic_mpc_disable();
  return (struct i2c_master_s *)priv;
}

/****************************************************************************
 * Name: rx65n_i2cbus_uninitialize
 *
 * Description:
 *   Uninitialize an RIIC device
 *
 ****************************************************************************/

int rx65n_i2cbus_uninitialize(FAR struct i2c_master_s *dev)
{
  FAR struct rx65n_i2c_priv_s *priv = (struct rx65n_i2c_priv_s *)dev;
  irqstate_t flags;

  DEBUGASSERT(dev);

  /* Decrement reference count and check for underflow */

  if (priv->refs == 0)
    {
      return ERROR;
    }

  flags = enter_critical_section();

  if (--priv->refs)
    {
      leave_critical_section(flags);
      return OK;
    }

  leave_critical_section(flags);

  /* Disable power and other HW resource (GPIO's) */

  rx65n_riic_int_disable(priv);

  irq_detach(priv->dev->txi_irq);
  irq_detach(priv->dev->rxi_irq);
  irq_detach(priv->dev->tei_irq);
  irq_detach(priv->dev->eei_irq);

  /* Release unused resources */

  nxsem_destroy(&priv->sem_excl);
  nxsem_destroy(&priv->sem_isr);

  return OK;
}

#endif /* CONFIG_RX65N_RIIC0 || CONFIG_RX65N_RIIC1 || CONFIG_RX65N_RIIC2 */
